[
  {
    "Title": "Resort Complex Adjacent to Top 10 National Park",
    "Revenue": null,
    "Ebitda": "$0 ",
    "Description": "This resort is situated in one of the world’s most popular tourist destinations and also an afternoon drive away from five other of the world’s premier travel sites, which together welcome over ten million visitors each year.  The sale includes: over 100 year’s of operational history, stellar online reviews, recent room upgrades, newly developed RV sites, the highest-rated restaurant for miles, a convenience store with gas,  a modern recreational park, conference center, leverageable water rights, and over 200 acres of undeveloped land (most of which is frontage to the main street into the federal park.)  Further, there are several modern homes on the property currently used by family members and staff that could easily be transitioned to revenue-producing rentals to increase cash flow for a new owner.\n*Note: There is a requirement in place that potential buyers need to have a minimum of $1M in liquidity to receive the information package for this deal.",
    "URL": "https://www.tworld.com/locations/soutah-novegas/listings/resort-complex-adjacent-to-top-10-national-park",
    "Geographic Location": "Salt Lake County,  Utah",
    "Agent Name": "Dan LeRoy",
    "Agent Email": "dan.leroy@tworld.com",
    "Agent Cell Phone": "(435) 817-9082",
    "Sale Price": "$12,000,000 "
  },
  {
    "Title": "Active Fun Entertainment Parks - Second Central Illinois Location",
    "Revenue": null,
    "Ebitda": "$858,819 ",
    "Description": "A popular and established indoor park franchise location in a top-10 central Illinois city is ready for its next owner.\n\nIn business for a number of years, everything is set for continued growth and expansion - equipment is in place, employees hired and trained along with seasoned management team and, of course, repeat clientele.\n\nThis indoor entertainment facility is designed to provide a variety of activities no matter what age - from climbing walls to bouncing along on connected trampolines.\n\nOwnership team willing to stay on for a period of time for seamless local transition and the franchisor supplements that with the proven support that has made it a recognized entertainment experience.\n\nProperty and building are also being offered so call for more details!",
    "URL": "https://www.tworld.com/locations/naperville/listings/active-fun-entertainment-parks---second-central-illinois-location",
    "Geographic Location": "Sangamon County,  Illinois",
    "Agent Name": "Steven Eschbach",
    "Agent Email": "seschbach@tworld.com",
    "Agent Cell Phone": "(630) 955-9516",
    "Sale Price": "$5,000,000 "
  },
  {
    "Title": "Trucking Company for Sale with Profitable Niche",
    "Revenue": null,
    "Ebitda": "$1,428,728 ",
    "Description": "Over the past decade this speciality trucking company has become one of New England's top intermodal drayage trucking companies picking up containers from three rail yards in Massachusetts and delivering them throughout New England. Out of its headquarters, it operates a fleet of 37 trucks and mainly serves freight forwarders and logistics brokers. Revenues exceed $10 million annual. Sale includes property worth $1.1 million and $1.5 million in receivables. Net income exceeds $1.4 million annually.",
    "URL": "https://www.tworld.com/locations/newhampshire/listings/trucking-company-for-sale-with-profitable-niche",
    "Geographic Location": "Hillsborough County,  New Hampshire",
    "Agent Name": "Jody Reese",
    "Agent Email": "jreese@tworld.com",
    "Agent Cell Phone": "(603) 935-5099",
    "Sale Price": "$5,000,000 "
  },
  {
    "Title": "$600K Net Near Absentee - Dedicated Medical Research Center",
    "Revenue": null,
    "Ebitda": "$625,870 ",
    "Description": "Unique opportunity to acquire a very profitable 25 year established, Orange County based Medical Research Center with an impeccable reputation for quality performance and results. The center is located in a highly populated area, within 30 minutes of Los Angeles, Riverside and San Diego Counties. CRO/Sponsors of  studies is a Who’s Who List of major pharmaceutical companies. The CRO/Sponsors repeat placing business studies based on their cyclical priorities and budgets and due to their confidence in the handling of their placements.  The following unique differentiators also explain why our client wins consistent and repeating study placements:\n\n•\tDepth of experience including completing 153 studies since 2003\n•\tSpecific expertise in diabetes and related diseases e.g.  weight loss, hypertension, neuropathic pain and high cholesterol\n•\tEmphasis on quality control and clean FDA audit history\n•\tConsistently growing database of 15,000 patients with detailed and updated Meta Data points\n•\tQuality of data captured along with study results provided\n•\tA consistent top 3 ranking among peer competitive research centers\n\nNear Absentee and Semi-retired MD- Seller has scaled back over past 5 years and currently only works in the business 4 hours per week. Two senior level experienced MDs split the Principal Investigatory duties working three days per week.  At current level of  10 – 15 concurrent  phase 2-3 studies, one full- time MD could potentially cover all of the MD responsibilities over a 5 day work week. Additional skilled and seasoned staff include Marketing and Recruiting Director, Business Manager and three to four  Study Coordinators.\n\nMost patients live within a reasonable drive time of the facility and participating patient visits average   6 -8 per day.  Approximately 30% of the patient visit is related to clinical investigation MD process while the Coordinators process the Investigational product and the administrative portion of the visit by compiling notes, processing documentation, ensuring quality control, and entering accurate data into the EDC System. Opportunities to expand and grow the business include increased investments in additional marketing resources to continue to approach new sponsors to acquire new studies, grow the patient database and expand the geographic footprint of the business by opening satellite offices in strategic locations throughout Southern California.\n\nSeller will provide buyer with excellent lease terms and turnkey office facility consisting of 7 exam rooms and more than 5,000 square feet in a recently upgraded medical building. Sellers are willing to fully support an ownership transition at mutually agreeable terms.",
    "URL": "https://www.tworld.com/locations/westla/listings/600k-net-near-absentee---dedicated-medical-research-center",
    "Geographic Location": "Orange County,  California",
    "Agent Name": "Stephen Menges",
    "Agent Email": "smenges@tworld.com",
    "Agent Cell Phone": "(310) 560-8928",
    "Sale Price": "$4,200,000 "
  },
  {
    "Title": "Active Fun Entertainment Parks - First Central Illinois Location",
    "Revenue": null,
    "Ebitda": "$402,075 ",
    "Description": "A popular and established indoor park franchise location in a top-25 central Illinois city is ready for its next owner.\n\nIn business for a number of years, everything is set for continued growth and expansion - equipment is in place, employees hired and trained along with seasoned management team and, of course, repeat clientele.\n\nThis indoor entertainment facility is designed to provide a variety of activities no matter what age - from climbing walls to bouncing along on connected trampolines.\n\nOwnership team willing to stay on for a period of time for seamless local transition and the franchisor supplements that with the proven support that has made it a recognized entertainment experience.\n\nProperty and building are also being offered so call for more details!",
    "URL": "https://www.tworld.com/locations/naperville/listings/active-fun-entertainment-parks---first-central-illinois-location",
    "Geographic Location": "McLean County,  Illinois",
    "Agent Name": "Steven Eschbach",
    "Agent Email": "seschbach@tworld.com",
    "Agent Cell Phone": "(630) 955-9516",
    "Sale Price": "$3,900,000 "
  },
  {
    "Title": "*Multi-Location, Lucrative Market Leader in Industrial Flooring*",
    "Revenue": null,
    "Ebitda": "$600,000 ",
    "Description": "Transworld Business Advisors of Atlanta Peachtree is proud to present this Unique opportunity to acquire an industry leading Industrial Flooring Company!\nThis Award Winning and Highly profitable company provides Industrial Flooring solutions and applications to a wide customer base including clients in Food, Beverage, Laboratory, Warehousing, Factories, and Manufacturing with the potential for broad applications for growth in other areas for a new buyer! The company has developed a longstanding niche and distinctive service by providing Specialty Custom Floor Solutions for some of the Nation’s biggest Food Processing Plants and Fortune 500 Clients!\nThis business has seen steady 25-year-old growth under the exceptional leadership of the owner with an outstanding company culture that fosters growth and an EXCELLENT first-class reputation. The company has enjoyed high revenues, fantastic profits, state of art equipment, and an exceptional facility. This Industry Leader has gained a strong market share by developing a brand that is synonymous with outstanding quality, excellence, and exceptional customer service!\nThis excellent company operates out of two locations in the Southeast with a loyal team of highly qualified long-term employees including several managers in place, a sales team, a specialized labor force, trained staff, all necessary equipment, and an EXTENSIVE future pipeline for a new buyer!\nThis is an EXTREMELY rare opportunity for a buyer looking to enter or expand into this selective market segment, with multiple opportunities to expand and poised for EXPLOSIVE GROWTH under a new owner. Company has key management in place and owner will work with buyer to ensure a smooth transition.\nInquire today because this Acquisition opportunity will not last long!",
    "URL": "https://www.tworld.com/locations/atlantapeachtree/listings/%2amulti-location--lucrative-market-leader-in-industrial-flooring%2a",
    "Geographic Location": "Georgia",
    "Agent Name": "Solomon Padilla",
    "Agent Email": "spadilla@tworld.com",
    "Agent Cell Phone": null,
    "Sale Price": "$3,500,000 "
  },
  {
    "Title": "Backyard Recreation & Home Improvement -Lender Pre-Qualified",
    "Revenue": null,
    "Ebitda": "$1,095,854 ",
    "Description": "This is a retail business selling high ticket items across Colorado for decades.  The industry had a fantastic 2020, and the forecast for the sector is strong. Demand for these products will not shift anytime soon.  Their fiscal year ended with $9.4mm in gross revenue.  The calendar year ended at $11.1mm.  2021 is showing even more growth. There will be three components to the pricing on this deal, a price for the business as listed here, plus a price for the inventory, and a price for the sold but undelivered goods.  The seller owns the real estate and would consider a sale of the real estate.  Inquire now for details.",
    "URL": "https://www.tworld.com/locations/colorado/listings/backyard-recreation---home-improvement--lender-pre-qualified",
    "Geographic Location": "Denver County,  Colorado",
    "Agent Name": "Chris Cantwell",
    "Agent Email": "ccantwell@tworld.com",
    "Agent Cell Phone": "(720) 370-0049",
    "Sale Price": "$3,375,000 "
  },
  {
    "Title": "Speciality  Manufacturer",
    "Revenue": null,
    "Ebitda": "$523,000 ",
    "Description": "Speciality Manufacture, Sales, Installation, and Service. A multi product manufacture with a captured client base serving Rhode Island, Massachusetts, and Connecticut. Established  in 1945. Located in the center of Rhode Island with easy highway access. They are an industry leader and the largest of there kind in the state. Excellent opportunity, for a family or Corporate Acquisition. Turn key operation, staffing in place, exceptional growth potential, with over a 1 Million dollar backlog.",
    "URL": "https://www.tworld.com/locations/providence/listings/speciality--manufacturer",
    "Geographic Location": "Rhode Island",
    "Agent Name": "Arthur Rosaki",
    "Agent Email": "arosaki@tworld.com",
    "Agent Cell Phone": "(401) 831-4428",
    "Sale Price": "$3,250,000 "
  },
  {
    "Title": "REDUCED!!! Commercial B2B Cleaning and Chemicals Company",
    "Revenue": null,
    "Ebitda": "$290,312 ",
    "Description": "This nearly 40 year old business specializes in commercial equipment rental and distribution and cleaning chemical redistribution serving many Large B2B clients. This business currently has very limited competition, a large and expandable service territory, expected to continue seeing growth, resilient to economic downturns.",
    "URL": "https://www.tworld.com/locations/savannah/listings/reduced----commercial-b2b-cleaning-and-chemicals-company",
    "Geographic Location": "Chatham County,  Georgia",
    "Agent Name": "David Johnson",
    "Agent Email": "djohnson@tworld.com",
    "Agent Cell Phone": "(678) 389-1441",
    "Sale Price": "$2,920,000 "
  },
  {
    "Title": "Great Opportunity Underground Utility Company with 1 Acre",
    "Revenue": null,
    "Ebitda": "$425,000 ",
    "Description": "Great opportunity 35 Year Underground Utility Company with 1 acre of commercial land. This company installs water sewer and Gas and Electric pipes and cables underground And also boxes man-made holes concrete structures and drainage. They have contracts with the biggest utility's companies in Alachua, Gru and Citrus County as well as railroad vendors. They also do Directional Boring for GRU since 1992 and the railroads.",
    "URL": "https://www.tworld.com/locations/jacksonville/listings/great-opportunity-underground-utility-company-with-1-acre",
    "Geographic Location": "Alachua County,  Florida",
    "Agent Name": "Joseph DiBartolo",
    "Agent Email": "jdibartolo@tworld.com",
    "Agent Cell Phone": "(352) 221-9667",
    "Sale Price": "$2,900,000 "
  },
  {
    "Title": "Established Powersports Sales/Service Business For Sale",
    "Revenue": null,
    "Ebitda": "$407,659 ",
    "Description": "**Increased sales/marketing staff, reduced local competition increased gross sales by $2 million (69%) to $4.9 million, doubled seller's discretionary earnings to $407,000**\n\n**Similar sales expected in 2021 with higher profits**\n\n**Pre-approved for financing to qualified buyers!!**\n\nA well-established (since 1969), turnkey motorsports dealership representing multiple top brands in the industry is ready for its next owner.\n\nKey investment considerations:\n\n * Excellent location with solid reputation.\n * Top performer among the well-known brand name it represents in both sales and service.\n * Growing and profitable business.\n * Added product line, reduced local competition and increased sales/marketing staff doubled profitability this year versus last.\n * Positive growth potential in a strong industry niche.\n * Asking price includes property (1.5 acres) with building (11,800 sq. ft.), both attractive in appearance in a commercial area with high traffic.\n * $687,000 inventory included.\n\nDealership includes related parts, accessories, apparel and service to product lines.  Owners have earned a solid reputation with customers, vendors and have become a great community staple. What sets them apart is their technicians are factory-trained at a top GOLD level to provide superior service to its customers.\n\nRevenues for the seven months ended July 31, 2021 were $2.8 million and presold units at August 1, 2021 were 59 that is expected to add $1.3 million in sales for units over the next 10 to 12 weeks along with approximately $180,000 in related accessories for all.  New sales are averaging 20 per month.\n\nFinancing is pre-approved for qualified buyers and owner will provide up to 90 days of transition/training services.",
    "URL": "https://www.tworld.com/locations/naperville/listings/established-powersports-sales-service-business-for-sale",
    "Geographic Location": "Illinois",
    "Agent Name": "Steven Eschbach",
    "Agent Email": "seschbach@tworld.com",
    "Agent Cell Phone": "(630) 955-9516",
    "Sale Price": "$2,600,000 "
  },
  {
    "Title": "High Profit Tree Nursery & Landscaping",
    "Revenue": null,
    "Ebitda": "$819,250 ",
    "Description": "This growing and highly profitable tree nursery and landscaping business has created high demand for their products and services across Southern Louisiana and the surrounding region. This company capitalizes on a strategic competitive advantage for much higher profitability than standard nurseries and landscaping companies. Specialty trees require lots of care and knowledge throughout the year, and this business capitalizes on the inventory, installation, and maintenance of these trees. The business is very well visible in a high traffic area of Baton Rouge and consistently brings in new customers each week. With little sales and marketing efforts, the company has maintained high profits and steady growth. The current owner is looking to retire, so a motivated buyer could easily scale this already profitable business.  The current owner has decades of experience and has successfully implemented this model in multiple markets. He is willing to stay on to acclimate the buyer to the business and to develop new clients. This opportunity has a high propensity for regional expansion in a short time period.",
    "URL": "https://www.tworld.com/locations/batonrouge/listings/high-profit-tree-nursery---landscaping",
    "Geographic Location": "East Baton Rouge Parish,  Louisiana",
    "Agent Name": "Joah Butler",
    "Agent Email": "jbutler@tworld.com",
    "Agent Cell Phone": "(225) 442-3157",
    "Sale Price": "$2,450,000 "
  },
  {
    "Title": "Multi-Unit Doctors Office Building For Sale",
    "Revenue": null,
    "Ebitda": "$0 ",
    "Description": "17,000 SF building on 2 Acres. Five leases in place with a large upstairs that is currently used for storage but could be leased. Currently leased to multiple doctors.\n\nExcellent location on a busy highway in a growing community!",
    "URL": "https://www.tworld.com/locations/nashville/listings/multi-unit-doctors-office-building-for-sale",
    "Geographic Location": "Sumner County,  Tennessee",
    "Agent Name": "Dick Sullivan",
    "Agent Email": "dsullivan@tworld.com",
    "Agent Cell Phone": null,
    "Sale Price": "$2,400,000 "
  },
  {
    "Title": "Commercial and Residential Rental Property Investment Portfolio",
    "Revenue": null,
    "Ebitda": "$195,600 ",
    "Description": "Income Producing Investment Portfolio that includes a combination of Commercial and Residential Rental Properties. Includes 18 residential units (apartments) and 3 Commercial Units. All are currently rented with long term leases and Tenants in place who wish to stay.  The first of these three locations which includes 3  residential rental units is located minutes to Downtown Nashville, minutes from Germantown and across the river from the soon to be massive Oracle Building Development. The second location which includes 9 residential rental units is located in Midtown Nashville.  The third sight is located minutes away in Hopkinsville KY right across the border of TN and includes 9 recently rehabilitated residential units as well as three commercial units.  All three locations have Tenants in place and collect a total of $16,300.00 per month.  All three locations are in opportunity zones which allow for a tax free transfer assuming the new owner holds the properties for at least one year.  Seller is willing to finance $1,000,000.00 of the total sale price. This is a turnkey operation with minimal attention required by ownership.  Option to Purchase sites separately or as a combination of the entire investment portfolio.  By request of the Owner this sale is required to be structured as a Stock Sale.\n\n-Cap Rate of 11.78\n-As Is, Inspections for Information Purposes Only\n-Opportunity Zones applicable for all three locations\n-Annual Rent $195,600.00\n-Montly Rent $16,300.00\n-Seller Financing Available up to $1,000,000.00\n-No Interior Photos as Tenants are in Place",
    "URL": "https://www.tworld.com/locations/nashville/listings/commercial-and-residential-rental-property-investment-portfolio",
    "Geographic Location": "Davidson County,  Tennessee",
    "Agent Name": "Dick Sullivan",
    "Agent Email": "dsullivan@tworld.com",
    "Agent Cell Phone": null,
    "Sale Price": "$2,305,635 "
  },
  {
    "Title": "Thriving, Profitable & Growing Transportation Company",
    "Revenue": null,
    "Ebitda": "$513,813 ",
    "Description": "Thriving bus line with established and profitably operated  routes and charter services has been serving the Pacific Northwest communities for more than a decade.\n\nThe charter division of the business is even more profitable and can experience explosive growth with a successful focus on staffing.",
    "URL": "https://www.tworld.com/locations/oregoncentral/listings/thriving--profitable---growing-transportation-company",
    "Geographic Location": "Oregon",
    "Agent Name": "Johnathan Choe",
    "Agent Email": "jchoe@tworld.com",
    "Agent Cell Phone": "(541) 920-9026",
    "Sale Price": "$2,150,000 "
  },
  {
    "Title": "Excellent Body Shop Business! Amazing Reputation",
    "Revenue": null,
    "Ebitda": "$500,000 ",
    "Description": "This business is built on Top Quality Work and a Top Quality Reputation. The customer base is extremely loyal and large companies love to take damaged vehicles to this location for repair on a regular basis. The owner has been in this field for a very long time and is ready to retire. There is a very well trained staff in place makes this a great opportunity for you to take to the next level of sales. Total Sales Price includes real estate. The FF&E is included and will allow a new owner to enter in to a smoothly running business. The owner is primarily managing the business and is mostly hands off of the repair work. This is an extremely profitable business that has a lot of potential to scale.",
    "URL": "https://www.tworld.com/locations/spartanburg /listings/excellent-body-shop-business--amazing-reputation",
    "Geographic Location": "Spartanburg County,  South Carolina",
    "Agent Name": "Eli Tatem",
    "Agent Email": "etatem@tworld.com",
    "Agent Cell Phone": "(864) 527-5995",
    "Sale Price": "$2,000,000 "
  },
  {
    "Title": "Aircraft Parts Manufacturer",
    "Revenue": null,
    "Ebitda": "$316,620 ",
    "Description": "Facility is a program machine shop specializing in Aerospace CNC type manufacturing. Providing quality through excellent performance operations. Company is a collective of people operating CAD/CAM programming up to 5 axis under a family owned business that upholds the required highest standard of quality to ensure precision resulting in 'sole-parts-source' for major DOD Aircraft manufacturers.",
    "URL": "https://www.tworld.com/locations/coachellavalley/listings/aircraft-parts-manufacturer-",
    "Geographic Location": "Riverside County,  California",
    "Agent Name": "Byron Graves",
    "Agent Email": "bgraves@tworld.com",
    "Agent Cell Phone": "(760) 766-3880",
    "Sale Price": "$2,000,000 "
  },
  {
    "Title": "Growing Senior Home Care Business In South Louisiana",
    "Revenue": null,
    "Ebitda": "$452,471 ",
    "Description": "This excellent senior home care business is very well liked in the area and is highly successful. It has all systems, processes and employees in place and training to be provided. This business excelled through 2020 and 2021. Call or email us today for more information!",
    "URL": "https://www.tworld.com/locations/lakecharles/listings/growing-senior-home-care-business-in-south-louisiana",
    "Geographic Location": "Lafayette Parish,  Louisiana",
    "Agent Name": "Ben Bernard",
    "Agent Email": "bbernard@tworld.com",
    "Agent Cell Phone": "(337) 358-1411",
    "Sale Price": "$1,950,000 "
  },
  {
    "Title": "Full Service Renovation Contracting Business",
    "Revenue": null,
    "Ebitda": "$595,000 ",
    "Description": "A full service contracting and restoration company that specializes in home (95% residential) remodeling, interior design, reconstruction, and emergency repairs. They utilize the latest construction technology and equipment and can transform any house into a dream home! This organization has multiple state licenses (plumbing, roofing, general contracting) allowing it to be a one stop shop for most affluent homeowners. There is a well tenured staff in place, including office and supervisory management. Furniture, Fixtures and Equipment includes state of the art computer systems and software and a fleet of well-maintained vehicles and trailers. The seller is offering a new 5-year lease starting at a below market rent, however the free-standing property is also available for purchase and is complete with fueling stations. There are about 6,750 sqft of space on about .41 of an acre, complete with multiple offices, upscale showroom and large warehouse with an extensive inventory (and samples) on hand. This opportunity is being offered now as the seller is planning to retire. He is open to seller financing a qualified purchaser with at least 2/3rd cash down, as well as staying on as a license qualifier (fee to be discussed). EIDL loan and A/R are negotiable. All prospective purchasers must be approved by the listing broker and provide a personal financial statement and CV. This opportunity may qualify for an investors Visa.",
    "URL": "https://www.tworld.com/locations/fortlauderdale/listings/full-service-renovation-contracting-business",
    "Geographic Location": "Broward County,  Florida",
    "Agent Name": "Thomas R Milana, P.A. CBI",
    "Agent Email": "tom@tworld.com",
    "Agent Cell Phone": "(754) 224-3118",
    "Sale Price": "$1,950,000 "
  },
  {
    "Title": "Incredible Ready-mix Concrete Company",
    "Revenue": null,
    "Ebitda": "$1,123,655 ",
    "Description": "An incredible ready-mix concrete company with batch plant, lots of great equipment, tenured employees - with proven scalability!",
    "URL": "https://www.tworld.com/locations/oregoncentral/listings/incredible-ready-mix-concrete-company",
    "Geographic Location": "Oregon",
    "Agent Name": "Lonnie Woodruff",
    "Agent Email": "lwoodruff@tworld.com",
    "Agent Cell Phone": "(541) 920-9026",
    "Sale Price": "$1,900,000 "
  },
  {
    "Title": "Personal Care Home in Peaceful, Country Setting",
    "Revenue": null,
    "Ebitda": "$123,827 ",
    "Description": "Established and profitable 18-room Personal Care Home in North Mississippi with real estate included.",
    "URL": "https://www.tworld.com/locations/jackson-oxford/listings/personal-care-home-in-peaceful--country-setting",
    "Geographic Location": "Mississippi",
    "Agent Name": "Victor Robinson",
    "Agent Email": "vicrobinson@tworld.com",
    "Agent Cell Phone": "(601) 826-3644",
    "Sale Price": "$1,685,000 "
  },
  {
    "Title": "Pool Service & Maintenance",
    "Revenue": null,
    "Ebitda": "$220,899 ",
    "Description": "Revenue through 8 months of 2021 is 30% over all of last year. Top rated, well run and managed pool cleaning, maintenance & repair business serving residential and commercial accounts. They employ top techs and have an office manager and service manager in place. All work and scheduling is electronically controlled to minimize travel time and maximize coverage. Job status and projects are updated in real time to connect with the customer, so they see the progress, status or condition of the job. The business includes employee handbook, wrapped vehicles, and team that is paid very competitive wages to provide top quality service.",
    "URL": "https://www.tworld.com/locations/tampa/listings/pool-service---maintenance",
    "Geographic Location": "Collier County,  Florida",
    "Agent Name": "Mike Kelly",
    "Agent Email": "mikekelly@tworld.com",
    "Agent Cell Phone": "(239) 478-0106",
    "Sale Price": "$1,650,000 "
  },
  {
    "Title": "Very successful & profitable liquor store",
    "Revenue": null,
    "Ebitda": "$0 ",
    "Description": "Liquor, beer, wine, lottery and ATM",
    "URL": "https://www.tworld.com/locations/nationalharbor/listings/very-successful---profitable-liquor-store",
    "Geographic Location": "Prince George's County,  Maryland",
    "Agent Name": "Jerry Elliott",
    "Agent Email": "jelliott@tworld.com",
    "Agent Cell Phone": "(301) 637-8090",
    "Sale Price": "$1,500,000 "
  },
  {
    "Title": "Industrial Blade Sharpening Business",
    "Revenue": null,
    "Ebitda": "$221,930 ",
    "Description": "Don’t miss your chance to own this well-established industrial blade sharpening business in the Jacksonville area since 1997 with great real estate included, valued at $440,000! Also conveys nearly $650,000 (at fair market value) of advanced equipment in great condition with plenty of capacity to grow. Includes CNC machines and a large amount of oil filtered automated equipment as well as spiral & diamond tooling machines that make this business not only the best of the best in the industry but saves time and keeps the profit margins high. Also conveys with $80,000 of inventory. They offer a full product line of in-stock items and a very nice retail area in the building. Great staff in place so this is a turnkey operation for a full-time owner-operator. Generous Seller training/transition period and Seller Financing for a qualified Buyer make this a great opportunity.",
    "URL": "https://www.tworld.com/locations/jacksonville/listings/industrial-blade-sharpening-business",
    "Geographic Location": "Duval County,  Florida",
    "Agent Name": "John Geiwitz",
    "Agent Email": "johng@tworld.com",
    "Agent Cell Phone": "(904) 647-4755",
    "Sale Price": "$1,500,000 "
  },
  {
    "Title": "Florida Sign Manufacturer and Installer",
    "Revenue": null,
    "Ebitda": "$538,478 ",
    "Description": "Successful Florida based sign manufacturer and installer covering the South East states of Florida, Georgia and Alabama. Strong relationships and quality workmanship make this a powerful acquisition for entrepreneurs and acquisition minded corps looking to expand into the booming South East. Solid team and equipment package. Seller willing to train",
    "URL": "https://www.tworld.com/locations/orlando/listings/florida-sign-manufacturer-and-installer",
    "Geographic Location": "Lake County,  Florida",
    "Agent Name": "Michael Shea",
    "Agent Email": "mike@tworld.com",
    "Agent Cell Phone": "(407) 745-0466",
    "Sale Price": "$1,450,000 "
  },
  {
    "Title": "Wholesale Greeting Card Company For Sale - Highly Profitable",
    "Revenue": null,
    "Ebitda": "$266,052 ",
    "Description": "Established wholesaler in the greeting cards, stationary & gifts industry for sale. Buyer will acquire a recognized, copyrighted greeting card line with several thousand designs and access to their large dealer network. Large, up-to-date inventory included in sale price.",
    "URL": "https://www.tworld.com/locations/atlantanw/listings/wholesale-greeting-card-company-for-sale---highly-profitable",
    "Geographic Location": "Cobb County,  Georgia",
    "Agent Name": "Jim Clarke",
    "Agent Email": "jim.clarke@tworld.com",
    "Agent Cell Phone": "(404) 600-1205",
    "Sale Price": "$1,400,000 "
  },
  {
    "Title": "Business for Sale with 26 Year History",
    "Revenue": null,
    "Ebitda": "$522,675 ",
    "Description": "Don’t let this one pass you by! Work where others go to vacation and enjoy a historic resort area known for “easy living” and gorgeous views. This business boasts a twenty-six-year history of success. Two locations in close proximity in a popular tourist destination offering apparel and desirable merchandise. Sale includes approximately $315,000 of inventory. Trailing Twelve Months used for 2021. NDA and PFS are required. Adjustment made for one full time owner/operator and to normalize rent expense.",
    "URL": "https://www.tworld.com/locations/jacksonville/listings/business-for-sale-with-26-year-history",
    "Geographic Location": "Nassau County,  Florida",
    "Agent Name": "Bianca Evans",
    "Agent Email": "bianca@tworld.com",
    "Agent Cell Phone": "(904) 425-9660",
    "Sale Price": "$1,395,000 "
  },
  {
    "Title": "Very Profitable NY State Gymnastics & Multi-Sport Business",
    "Revenue": null,
    "Ebitda": "$525,000 ",
    "Description": "This quality proven business has been in operation for 20+ years and has built a reputable Brand across the Northeast.  The business is located in a growing suburban area within a 20,000 sq. ft. freshly remodeled space.  The multi-sport programs include: Preschool, Parent/Toddler, Recreational & Team Gymnastics, Ninja, Parties, and Private Lessons. The primary sport thriving with growth is Gymnastics. The growth coupled with a favorable lease make this opportunity a great cash flow generator for years to come.  The owners are ready to help with the transition to keep the positive momentum. This business is priced to sell.",
    "URL": "https://www.tworld.com/locations/syracuse/listings/very-profitable-ny-state-gymnastics---multi-sport-business",
    "Geographic Location": "New York",
    "Agent Name": "Kevin Everts",
    "Agent Email": "keverts@tworld.com",
    "Agent Cell Phone": "(315) 962-9200",
    "Sale Price": "$1,350,000 "
  },
  {
    "Title": "Make an Offer! Three-locations. After-School Development Ed.",
    "Revenue": null,
    "Ebitda": "$51,619 ",
    "Description": "Make a difference in the lives of children with this established brand and its meaningful cash flow!\n\nInvesting in this established franchise will save you valuable start-up time and money.\n\nThe price includes the purchase of all three operating locations, plus two locations to be opened and ownership of the entire Colorado territory.\n\nThe individual locations can be purchased separately.  Please see those individual listings.\n\nThis business is for you if you want great cash flow while making a difference, seeing children's faces light up as they overcome obstacles. Flexible schedule, low overhead, and impressive results. Franchise license ($65,000 per location) is included in the sale.\n\nInquire for more details and to learn about new SBA initiatives, including how to get payments forgiven for 3 months! At Transworld Business Advisors of Colorado, we are the most active business brokerage company - listing and selling the most businesses in the state. Get added to our buyer list today to receive deals as they hit the market.",
    "URL": "https://www.tworld.com/locations/colorado/listings/make-an-offer--three-locations--after-school-development-ed-",
    "Geographic Location": "Colorado",
    "Agent Name": "Keith Marlow",
    "Agent Email": "kmarlow@tworld.com",
    "Agent Cell Phone": "(970) 616-0774",
    "Sale Price": "$1,299,000 "
  },
  {
    "Title": "Indoor Grow NW Oklahoma, 20,000 SF potential, w/Real Estate!",
    "Revenue": null,
    "Ebitda": "$0 ",
    "Description": "The medical cannabis in-door grow facility is outfitted for growing in a multi-level brick warehouse. The warehouse is currently utilizing 4, 25 SF X 20 SF grow rooms; for a total of 2,000 SF yet has the building size to expand to 20,000 SF. Robust irrigation system with new AC units for climate control.. Three phase power source with all the perks of being located in a business district. Standard non-disclosure & proof of funds will be required prior to disclosure of the in-door grow details..",
    "URL": "https://www.tworld.com/locations/okc/listings/indoor-grow-nw-oklahoma--20-000-sf-potential--w-real-estate-",
    "Geographic Location": "Woodward County,  Oklahoma",
    "Agent Name": "Jack Rawdon",
    "Agent Email": "jrawdon@tworld.com",
    "Agent Cell Phone": "(405) 795-1462",
    "Sale Price": "$1,199,000 "
  },
  {
    "Title": "Multi-Branch Gulf Coast Staffing Agency - Primed for Growth",
    "Revenue": null,
    "Ebitda": "$313,216 ",
    "Description": "The business provides professional staffing solutions to/ for its customers.\n\nOne customer is the actual workforce (e.g. the temp. employees ~2000/yr.), the other customer is the business clients (~150/yr. on avg. active).\n\nB2B – relationship/sales - where orders are created and sales generated (the “hunter”); however, filling the orders and meeting client’s needs is key (the “farmer”).\n\n2 Locations in different markets creates solid diversity and hedges risks. A third location would create a lot of value to the new owner. Significant upside to double the business quickly.\n\nNearly every businesses is a potential customer. Immense market.  Larger manufacturing/plant type clients provide high volume but lower margins and the smaller businesses less volume but  often come with higher margins.\n\nThe business doesn’t have much of a seasonal factor except being a little slower during Christmas holidays and some summer weeks.\n\nThe Company is a franchisee of a national organization, which provides name recognition, marketing tools, access to insurance products, back office support, IT, etc. yielding more favorable experiences and relationships, which contributes to higher margins while remaining price competitive. More time for the business to ‘hunt’ and ‘farm’ than living in the typical administrative daily minutia.\n\nThe owner now works approximately 15 hours a week, enjoys the coaching and teaching aspect of things to make his staff more successful, while hiring great branch managers to take over the day-to-day operations.\n\nReason for Selling: The owner is approaching retirement; has reached his point of indifference in his business growth aspirations, reached a stabilized level, and has the business running where it should be an easy transition for a new qualified buyer. Owner’s monetization of this business sale should allow for the Seller (and his spouse) to reach their retirement objective. Transition Services of two weeks to new owner are included in the price, and longer as mutually agreed.",
    "URL": "https://www.tworld.com/locations/gulfcoast/listings/multi-branch-gulf-coast-staffing-agency---primed-for-growth",
    "Geographic Location": "Mobile County,  Alabama",
    "Agent Name": "Chris Bruner",
    "Agent Email": "cbruner@tworld.com",
    "Agent Cell Phone": "(251) 237-1030",
    "Sale Price": "$1,150,000 "
  },
  {
    "Title": "Arcade Game Mfr / Wholesale/Retail/Service Games/Billiards",
    "Revenue": null,
    "Ebitda": "$165,435 ",
    "Description": "Manufactures custom arcade games.\nWholesales, retails, and services arcade games (60% of business).\nTwo Year Warranty offered on all manufactured arcade games.\nWholesales and retails air hockey games and pool tables (40% of business).\nServices air hockey games and pool tables/billiards.\nProvides a pool table refelting service in numerous colors.\nCarries parts and accessories.\n--\nThis business was established in 2008, current owners have owned and operated this business since 2015. Owners estimate that 60% of their business revolves around arcade games and 40% around pool table product lines.\nAssets include two work vans, all furniture, fixtures, equipment, supplies, and materials to operate the business, business name, domain name, website, and social media business page. New business arrives via website and social media, along with significant word-of-mouth referrals. Operations have expanded outside the general Sevier County and East Tennessee areas into several other areas. This business is poised for expansion and growth. Owner will train at no cost for up to 60 business days.",
    "URL": "https://www.tworld.com/locations/knoxville/listings/arcade-game-mfr---wholesale-retail-service-games-billiards",
    "Geographic Location": "Sevier County,  Tennessee",
    "Agent Name": "Sheila Hansen",
    "Agent Email": "shansen@tworld.com",
    "Agent Cell Phone": null,
    "Sale Price": "$999,000 "
  },
  {
    "Title": "44 Yrs of Great Profits! Pool and Spa Business Pre-Approved!",
    "Revenue": null,
    "Ebitda": "$277,966 ",
    "Description": "With over 40 years in the industry, this swimming pool and spa company has been a leader in both the service and retail sectors.  The referral base is so impressive, the company has not had to take on new clients. New pool installations have steadily increased and the demand for service and parts is growing. The business is in a prime position in the market and is poised for continued growth.\n\nMake $277,000 in year one with only a $100,000 down payment!\n\nInquire for more details and to learn about new SBA initiatives, including how to get payments forgiven for 3 months! At Transworld Business Advisors of Colorado, we are the most active business brokerage company - listing and selling the most businesses in the state. Get added to our buyer list today to receive deals as they hit the market.",
    "URL": "https://www.tworld.com/locations/colorado/listings/44-yrs-of-great-profits--pool-and-spa-business-pre-approved-",
    "Geographic Location": "Arapahoe County,  Colorado",
    "Agent Name": "Keith Marlow",
    "Agent Email": "kmarlow@tworld.com",
    "Agent Cell Phone": "(970) 616-0774",
    "Sale Price": "$995,000 "
  },
  {
    "Title": "Highly Profit Dry Cleaner with Laundry Contracts wi",
    "Revenue": null,
    "Ebitda": "$206,080 ",
    "Description": "This long established Dry Cleaner added a commercial laundry side in 2019 and has established relationships with several major hotels in the metro.  The commercial laundry has also increased the revenue for the Dry Cleaning side of the house as the hotel additionally send along guest dry cleaning.  Great profits are just the base line for what this laundry is capable of achieving with the current equipment.",
    "URL": "https://www.tworld.com/locations/kansascitywest/listings/highly-profit-dry-cleaner-with-laundry-contracts-wi",
    "Geographic Location": "Wyandotte County,  Kansas",
    "Agent Name": "Sheldon Schelling",
    "Agent Email": "sschelling@tworld.com",
    "Agent Cell Phone": "(913) 336-0002",
    "Sale Price": "$980,000 "
  },
  {
    "Title": "Greater Boston Trucking Company",
    "Revenue": null,
    "Ebitda": "$494,670 ",
    "Description": "Local and short-haul trucking company serving the greater Massachusetts market. This company specializes in ground expediting, short-term storage, truckloads and LTL shipments, and dedicated runs for local and regional customers. The company operates a fleet of 6 Freightliner tractors and over 20 trailers.  Fully licensed and insured, this company has a strong reputation in the region and extensive customer list. Consistent sales and profits over the years and showing a stable 10% growth trend for 2021. Owner will provide training/support during transition period.",
    "URL": "https://www.tworld.com/locations/northboston/listings/greater-boston-trucking-company",
    "Geographic Location": "Middlesex County,  Massachusetts",
    "Agent Name": "Aaron Fox",
    "Agent Email": "afox@tworld.com",
    "Agent Cell Phone": "(781) 773-8922",
    "Sale Price": "$965,000 "
  },
  {
    "Title": "Profitable and upgraded Print Marketing and Design",
    "Revenue": null,
    "Ebitda": "$252,857 ",
    "Description": "Originally founded in 1987, this printing shop has become a strong player in the Metro Atlanta market by offering a variety of services used by consumers, small and large businesses.\n\nThe quality of the work and customer service has produced a constant uptrend in the annual sales and net profits. The shop is fully staffed with a Production Manager and 7 staff members, allowing the owner to work one day a week.  The key personnel has been with the business for 5+ years.\n\nThe shop has a strong list of business clients, updated equipment and a strong operational system in place.\n\nProfessional Printing Services Include:\n\nDesign\nDigital and Offset Printing\nDirect Mail and Variable Data\nLarge Format Posters and Banners\nBanner Stands and Trade Show Displays\nSignage\nReprographics\nKitting and Fulfillment\nFinishing\nPick-Up and Delivery",
    "URL": "https://www.tworld.com/locations/atlantanorth/listings/profitable-and-upgraded-print-marketing-and-design-",
    "Geographic Location": "Fulton,  Georgia",
    "Agent Name": "Jon Roman",
    "Agent Email": "atlantanorth@tworld.com",
    "Agent Cell Phone": "(404) 666-4486",
    "Sale Price": "$950,000 "
  },
  {
    "Title": "Mobile Home Supply Store with Real Estate located on Major Hwy",
    "Revenue": null,
    "Ebitda": "$143,278 ",
    "Description": "Putnam County Mobile Home Supply store located on busy Highway. Includes 9.29 Acres 3 buildings (15,000 SF, 2160SF, 2160 SF) and 2 Large Billboards. Same owner for 30 years this business has a loyal following. Real Estate and buildings have enough room to grow or add additional business to this location. Billboard is a great source of extra revenue.",
    "URL": "https://www.tworld.com/locations/jacksonville/listings/mobile-home-supply-store-with-real-estate-located-on-major-hwy",
    "Geographic Location": "Putnam County,  Florida",
    "Agent Name": "Richard Murray",
    "Agent Email": "rmurray@tworld.com",
    "Agent Cell Phone": "(904) 903-2388",
    "Sale Price": "$900,000 "
  },
  {
    "Title": "Profitable Pizzeria in Great Location",
    "Revenue": null,
    "Ebitda": "$383,660 ",
    "Description": "Amazing opportunity for the restaurant entrepreneur. This Franchise pizzeria/bar comes with like-new equipment and furniture.  Located in a high traffic upscale shopping center in desirable Raleigh, NC, this restaurant was experiencing growth month-over-month before the pandemic. The business take-out and delivery business grew exponentially during 2020. After gaining new customers during the pandemic, revenue is staying consistent in 2021. Customers can dine in with a serving area that seats over 110 people or cozy up in the fully equipped bar that seats over 30.\n\nThe franchise offers 6 weeks of training to prepare you to run the business.",
    "URL": "https://www.tworld.com/locations/raleigh/listings/profitable-pizzeria-in-great-location",
    "Geographic Location": "Wake County,  North Carolina",
    "Agent Name": "Tina Wright, MBA, CBI",
    "Agent Email": "twright@tworld.com",
    "Agent Cell Phone": "(919) 879-3255",
    "Sale Price": "$900,000 "
  },
  {
    "Title": "Price Reduction! Home Staging & Design at its Finest!",
    "Revenue": null,
    "Ebitda": "$287,181 ",
    "Description": "As Charlotte continues to be one of the fastest growing cities in the US, the real estate markets continue to soar.  The demand for home staging has steadily increased, and this business has grown to be one of the largest in the entire region.\n\nFocusing on quality and premium service, this brand has grown to be the go-to stager for luxury homes.  Their in-house staff of designers and movers gives their clients white glove service and dependability.  Additionally, their massive inventory of furniture and accessories gives the designers substantial creative freedom and it enables them to deliver a premium experience to their clients.  Lastly, the business sale also includes several commercial vehicles that allow the team to be on-time and reliable for their staging clients.\n\nThis is a rare opportunity to purchase a premium brand and an exceptionally well-run business with substantial inventory, furniture, and equipment.  Don't miss your chance to be the new owner and become a major part of the real estate market here in Charlotte.",
    "URL": "https://www.tworld.com/locations/charlottesouth/listings/price-reduction--home-staging---design-at-its-finest-",
    "Geographic Location": "Mecklenburg County,  North Carolina",
    "Agent Name": "Scott Pool",
    "Agent Email": "spool@tworld.com",
    "Agent Cell Phone": "(704) 906-2270",
    "Sale Price": "$895,000 "
  },
  {
    "Title": "Award-Winning Taphouse / Restaurant",
    "Revenue": null,
    "Ebitda": "$107,000 ",
    "Description": "Unique, upscale beer emporium offers 52 different craft beers on tap (many of them local), a variety of import beers, craft wines and a fresh, family-friendly food menu. The business has a strong social media presence and loyal customer base. Indoor, expanded patio seating, online ordering and take-out offerings have helped this business maintain growth during the pandemic. The friendly, knowledgeable staff and carefully selected entertainment all add to the upbeat vibe. There is a tremendous opportunity for growth given the demographic, location, growing area, and unique beverage and food selections. Great concept for a potential franchisor opportunity.",
    "URL": "https://www.tworld.com/locations/colorado/listings/award-winning-taphouse---restaurant",
    "Geographic Location": "Broomfield County,  Colorado",
    "Agent Name": "Tatiana Demoraes",
    "Agent Email": "tatiana@tworld.com",
    "Agent Cell Phone": "(720) 664-4474",
    "Sale Price": "$850,000 "
  },
  {
    "Title": "Preschool and Day Care with Real Estate in Polk County",
    "Revenue": null,
    "Ebitda": "$263,223 ",
    "Description": "Polk County Preschool with real estate INCLUDED. Established over 45 years ago in 1976 and expanded with 2nd building in 2002. Grandfather Licensed for well over 120 children under 4,776 feet in 2 well-appointed buildings on almost one acre with plenty of shade trees. Director has worked at the center full-time for 21 years. She has been director since the current owners purchased 13 years ago, But the OB is recast as an owner/operator/director. The buildings are clean, neat, and in excellent condition with new roofs installed in August 2020 with a 50-year warranty! Owner decided it is time to retire which creates this unique opportunity. Very clean books and records. Other is for rent & Amortization. Seller may hold note to assist buyer in coming up with down payment. 2021 FINS are extrapolated using Jan - Aug. Purchase may qualify for visa. Financial Recasting does not include the $29,376 Grants in 2020. Seller works 10 hours a week doing paperwork and does not teach or work at the center.",
    "URL": "https://www.tworld.com/locations/orlando/listings/preschool-and-day-care-with-real-estate-in-polk-county",
    "Geographic Location": "Polk County,  Florida",
    "Agent Name": "H. Joe Strickland",
    "Agent Email": "hjoe@tworld.com",
    "Agent Cell Phone": "(407) 745-0465",
    "Sale Price": "$850,000 "
  },
  {
    "Title": "Successful liquor store in great location",
    "Revenue": null,
    "Ebitda": "$0 ",
    "Description": "Liquor, beer, wine, ATM, check cashing & lottery",
    "URL": "https://www.tworld.com/locations/nationalharbor/listings/successful-liquor-store-in-great-location",
    "Geographic Location": "Prince George's County,  Maryland",
    "Agent Name": "Jerry Elliott",
    "Agent Email": "jelliott@tworld.com",
    "Agent Cell Phone": "(301) 637-8090",
    "Sale Price": "$800,000 "
  },
  {
    "Title": "Established 14 Bay Auto Repair Shop Franchise",
    "Revenue": null,
    "Ebitda": "$201,372 ",
    "Description": "This highly reputable automotive repair and transmission shop franchise resale is located in the South Side of Houston. Situated on a major road with high traffic, this business has many repeat customers to go along with its average 4+ star rating on Google Reviews and Yelp. State-of-the-art facility is in excellent condition with 14 bays! Plenty of room for future growth opportunities. With more than 100 years of combined automotive experience, technicians are ASE Master L1 certified with many years of experience working domestic and foreign cars. This franchise has been operating in this part of town for over 12 years. This is truly a great turn-key automotive repair franchise resale opportunity!",
    "URL": "https://www.tworld.com/locations/houston/listings/established-14-bay-auto-repair-shop-franchise-",
    "Geographic Location": "Brazoria County,  Texas",
    "Agent Name": "Mark Le",
    "Agent Email": "mark.le@tworld.com",
    "Agent Cell Phone": "(832) 360-7496",
    "Sale Price": "$800,000 "
  },
  {
    "Title": "OKC Auto Repair Experts Business w/Real Estate",
    "Revenue": null,
    "Ebitda": "$104,469 ",
    "Description": "Family owned business delivering honest and professional automotive repair and auto maintenance services to the people of Oklahoma City and surrounding areas. Our ASE certified technicians employ todays latest technology and are equipped to handle any type of domestic or foreign auto repair.",
    "URL": "https://www.tworld.com/locations/okc/listings/okc-auto-repair-experts-business-w-real-estate",
    "Geographic Location": "Oklahoma County,  Oklahoma",
    "Agent Name": "Jack Rawdon",
    "Agent Email": "jrawdon@tworld.com",
    "Agent Cell Phone": "(405) 795-1462",
    "Sale Price": "$799,900 "
  },
  {
    "Title": "Unbranded C-Store with Gas in Giles County, VA - 141921 AS",
    "Revenue": null,
    "Ebitda": "$110,000 ",
    "Description": "Unbranded convenience store with Gas on a corner lot approximate.39+/- acres.\n\nMaterial Facts:\n• Sales Year 2020: $550,000 +/-\n• Gallons 2020: - 216,000 +/-\n• Business Sq. ft.: - 6,216 +/-\n\nOn a major busy street at an intersection ensures a high volume of vehicle and foot traffic and a steady stream of clientele. This business strategic location next to residential and business communities.\n\nAll the Fueling Stations are brand new with EMV and the site is in good standing with the department of environmental quality. It does not tie the site up with any fuel supply contract, so the buyer has the leverage to work with someone of their choice and rebrand the site. It also has a brand-new roof installed.\n\nOn the subject site itself, there is a 2-tenant commercial strip which is generating a rental income for the current owner.\n\nBusiness suitable for bank finance.\n\n**The Real Estate Agent - TBA RVA Realty Inc. will do all real estate transactions**",
    "URL": "https://www.tworld.com/locations/rva/listings/unbranded-c-store-with-gas-in-giles-county--va---141921-as",
    "Geographic Location": "Giles County,  Virginia",
    "Agent Name": "Andy Shah",
    "Agent Email": "ashah@tworld.com",
    "Agent Cell Phone": "(804) 409-0930",
    "Sale Price": "$799,000 "
  },
  {
    "Title": "Amazing Opportunity Successful Italian Restaurant",
    "Revenue": null,
    "Ebitda": "$280,000 ",
    "Description": "Amazing opportunity. Successful Pizza and Italian Restaurant Well-established, high-volume, profits 25%.Very Good rent. Located in a very upscale neighborhood, booming population, High-end building. Beer and Wine License, Authentic Italian dishes, traditional house-made fresh pizza dough. State-of-the-art fully equipped kitchen, trained staff in place. 95 seats.Very profitable, excellent books.Turn-key operation. Parking on-site. Qualify for a visa E2 or Green Card.",
    "URL": "https://www.tworld.com/locations/jacksonville/listings/amazing-opportunity-successful-italian-restaurant",
    "Geographic Location": "Alachua County,  Florida",
    "Agent Name": "Joseph DiBartolo",
    "Agent Email": "jdibartolo@tworld.com",
    "Agent Cell Phone": "(352) 221-9667",
    "Sale Price": "$795,000 "
  },
  {
    "Title": "Amazing opportunity Successful Pizza Restaurant",
    "Revenue": null,
    "Ebitda": "$280,000 ",
    "Description": "Amazing opportunity. Successful Pizza and Italian Restaurant Well-established, high-volume, profits 25%.Very Good rent. Located in a very upscale neighborhood, booming population, High-end building. Beer and Wine License, Authentic Italian dishes, traditional house-made fresh pizza dough. State-of-the-art fully equipped kitchen, trained staff in place. 95 seats.Very profitable, excellent books.Turn-key operation. Parking on-site. Qualify for a visa E2 or Green Card.",
    "URL": "https://www.tworld.com/locations/jacksonville/listings/amazing-opportunity-successful-pizza-restaurant",
    "Geographic Location": "Alachua County,  Florida",
    "Agent Name": "Joseph DiBartolo",
    "Agent Email": "jdibartolo@tworld.com",
    "Agent Cell Phone": "(352) 221-9667",
    "Sale Price": "$795,000 "
  },
  {
    "Title": "Iconic Portland Eatery:  The Gold Standard of Quality and Profits",
    "Revenue": null,
    "Ebitda": "$0 ",
    "Description": "Take advantage of a once in a generation opportunity to own a Portland, Maine institution. This iconic restaurant is not only the gold standard for high end Maine eateries, it is also a profit making behemoth. Following a proven formula developed over forty years in the F&B industry, this 'jewel of the Portland restaurant scene’, featured on local tv and print media on numerous occasions, features a warm and inviting feel combined with seamless, friendly and professional service. The owner has structured a meticulous operational formula that is a virtual guarantee for transitional success and should serve as a definition for ’turn key’ in the industry. Defined by a spectacular liquor collection and top quality menu offerings, this restaurant has no real regional competition and stands alone at the top in its category in the greater Portland area. Staff is extremely dedicated and long tenured. Staff turnover is virtually unheard of. Do not miss this opportunity as restaurants of this quality rarely make it to the market.\n\nListing price $785,000.00\nFF&E $150,000.00\nRevenues: (2019) $898.436 (2020 COVID YEAR) $598,607\nLocation: Portland, Maine\nDiscretionary Income: $220,674 (Average of past 3 yrs)\nYears in Business: 8\nYears Owned: 8\nNumber of Employees: 11 FT 0 PT 3 Contractors\nInventory: $150,000 (Liquor + Ave food inventory)\nReason for Selling: Retirement",
    "URL": "https://www.tworld.com/locations/portlandmainenorth/listings/iconic-portland-eatery%3a--the-gold-standard-of-quality-and-profits",
    "Geographic Location": "Maine",
    "Agent Name": "Seth Silverton",
    "Agent Email": "sethsilverton@tworld.com",
    "Agent Cell Phone": "(207) 835-4482",
    "Sale Price": "$785,000 "
  },
  {
    "Title": "Established Auto Collision Business w/ Real Estate",
    "Revenue": null,
    "Ebitda": "$0 ",
    "Description": "Mutli-function automotive business",
    "URL": "https://www.tworld.com/locations/savannah/listings/established-auto-collision-business-w--real-estate",
    "Geographic Location": "Glynn County,  Georgia",
    "Agent Name": "David Johnson",
    "Agent Email": "djohnson@tworld.com",
    "Agent Cell Phone": "(678) 389-1441",
    "Sale Price": "$779,799 "
  },
  {
    "Title": "Italian Restaurant with two Locations Be the Pizza King",
    "Revenue": null,
    "Ebitda": "$346,085 ",
    "Description": "2 PREMIUM locations with outstanding pizza, well known in the market and a tradition of quality and excellent reputation enables this once-in a lifetime opportunity to be sold. Excellent staff, with management in place, well known in the community and featured as one of the top pizza and Italian restaurants  in Jacksonville excellent records, These stores are THE BEST OF THE BEST. Opportunity won't last",
    "URL": "https://www.tworld.com/locations/jacksonville/listings/italian-restaurant-with-two-locations-be-the-pizza-king",
    "Geographic Location": "Duval County,  Florida",
    "Agent Name": "Victor Cirillo",
    "Agent Email": "vcirillo@tworld.com",
    "Agent Cell Phone": "(904) 425-9663",
    "Sale Price": "$750,000 "
  },
  {
    "Title": "High Profit SEO Optimized Security Systems Contractor",
    "Revenue": null,
    "Ebitda": "$194,141 ",
    "Description": "2020 discretionary earnings of $194k, with '21 trending toward $374k. Requires C-7 (low voltage) or C-10 license. Highly profitable portable solar CCTV surveillance, LED lighting, Security Systems business in SoCal. Specialties include sales, installation, monitoring and servicing of residential and commercial security systems, selling and renting portable solar-powered CCTV surveillance and lighting systems for job sites, shopping centers, night work, special events, etc. Their online presence is established and strong.",
    "URL": "https://www.tworld.com/locations/sandiegonorth/listings/high-profit-seo-optimized-security-systems-contractor",
    "Geographic Location": "San Diego County,  California",
    "Agent Name": "Dana Smith",
    "Agent Email": "dsmith@tworld.com",
    "Agent Cell Phone": "(760) 473-8597",
    "Sale Price": "$725,000 "
  },
  {
    "Title": "Profitable Commercial HVAC Business for Sale - Seller Financing",
    "Revenue": null,
    "Ebitda": "$345,746 ",
    "Description": "If a fully staffed business with a great reputation and high growth potential interests you, look no further!\n\nThis essential and recession-proof business provides and installs HVAC equipment and ductwork for new construction, tenant improvement, and remodels while also doing repair, replacement, and service work. Customers include senior living facilities, office buildings, restaurants, warehouses, hotels...\n\nWith only word-of-mouth marketing, this company has built strong relationships with general contractors and the community. Create your own online presence and advertising to grow even more!\n\nThrough quality management and excellent employee retention, this business has a solid hold on commercial projects in a continually growing industry. It comes complete with top-rate equipment and a highly experienced, knowledgeable staff.\n\nAt Transworld Business Advisors of Colorado, we are the most active business brokerage company - listing and selling the most businesses in the state. Get added to our buyer list today to receive deals as they hit the market.",
    "URL": "https://www.tworld.com/locations/colorado/listings/profitable-commercial-hvac-business-for-sale---seller-financing",
    "Geographic Location": "Denver County,  Colorado",
    "Agent Name": "Tyler Bowman",
    "Agent Email": "tbowman@tworld.com",
    "Agent Cell Phone": "(720) 506-4977",
    "Sale Price": "$725,000 "
  },
  {
    "Title": "Restoration & Remediation Business for Sale - Seller Financing",
    "Revenue": null,
    "Ebitda": "$456,752 ",
    "Description": "This company specialize in residential property damage claims including Water, Fire, Hail, Wind, Smoke, and Roofs. Services include Restoration, Remediation, Reconstruction and Remodels around Colorado Springs. The business has established relationships with insurance adjusters and mitigation companies that refer work.\n\nLarge growth opportunities include starting advertising campaigns and expanding into the Denver market!\n\nReason for Sale: Retirement\n\nSDE for January-June 2021: $228,376\nAnnualized 2021: $456,752\n\nInquire for more details and to learn about new SBA initiatives, including how to get payments forgiven for 3 months! At Transworld Business Advisors of Colorado, we are the most active business brokerage company - listing and selling the most businesses in the state. Get added to our buyer list today to receive deals as they hit the market.",
    "URL": "https://www.tworld.com/locations/colorado/listings/restoration---remediation-business-for-sale---seller-financing",
    "Geographic Location": "El Paso County,  Colorado",
    "Agent Name": "Tyler Bowman",
    "Agent Email": "tbowman@tworld.com",
    "Agent Cell Phone": "(720) 506-4977",
    "Sale Price": "$675,000 "
  },
  {
    "Title": "15 yrs+ Bridal/Formal Boutique - SW Houston",
    "Revenue": null,
    "Ebitda": "$86,403 ",
    "Description": "This elegant bridal shop is the premier go to wedding/formal dress in SW Houston, with an established location of over 15 years! Rated highly at 4+ stars on both Yelp and Google Reviews. The seller is the original owner and is seeking retirement. The business is on a standalone building highly visible from the high trafficked Highway 6 road. Owner invested heavily on the interior buildout of the store to create a unique shopping experience for each future bride. Boutique carries a large inventory with a wide range of dresses that meet the needs of budget-minded brides to be as well as those seeking high-end brand labels. This is an excellent opportunity for those seeking an acquisition opportunity to expand current bridal operations or a new entrepreneurial spirit who has always dreamed of being in the wedding retail space. Take advantage of capitalizing on this turnkey operation fulling complete with furniture, fixtures, inventory, and a team of trained loyal workers/management all in place and earn cashflow on day one.",
    "URL": "https://www.tworld.com/locations/houston/listings/15-yrs%2b-bridal-formal-boutique---sw-houston",
    "Geographic Location": "Harris County,  Texas",
    "Agent Name": "Mark Le",
    "Agent Email": "mark.le@tworld.com",
    "Agent Cell Phone": "(832) 360-7496",
    "Sale Price": "$670,000 "
  },
  {
    "Title": "Fast Casual Burger Restaurant with Real Estate and Drive Through",
    "Revenue": null,
    "Ebitda": "$87,415 ",
    "Description": "Home of the area's favorite classics burgers, fries, milkshakes, deli sandwiches, corn dogs & more! This locally owned and operated restaurant is located in Pasco, Washington. They strive to serve you the best in comfort food in the quickest and friendliest manner possible. They buy as much as they can locally to help support the local community and frequently add new items to the menu to satisfy their growing repeat customer base. Strategically located off the freeway in an industrial area on a busy main street with easy access in and out. This high visibility location also keeps the building and landscape in tip-top shape. Plenty of parking and a wonderful drive-through for those who chose not to dine inside.\nThe $650,000 listing price includes both the Business and the Property.\nBusiness listed at $175,000\nProperty listed at $475,000",
    "URL": "https://www.tworld.com/locations/centralwashington/listings/fast-casual-burger-restaurant-with-real-estate-and-drive-through",
    "Geographic Location": "Franklin County,  Washington",
    "Agent Name": "Caroline Kelliher",
    "Agent Email": "ckelliher@tworld.com",
    "Agent Cell Phone": "(509) 558-7150",
    "Sale Price": "$650,000 "
  },
  {
    "Title": "Highly Successful Boutique for Sale in The Villages Florida",
    "Revenue": null,
    "Ebitda": "$307,912 ",
    "Description": "Update",
    "URL": "https://www.tworld.com/locations/ocala/listings/highly-successful-boutique-for-sale-in-the-villages-florida-",
    "Geographic Location": "Sumter County,  Florida",
    "Agent Name": "DawnMarie Crown",
    "Agent Email": "dawn@tworld.com",
    "Agent Cell Phone": "(352) 234-8099",
    "Sale Price": "$649,500 "
  },
  {
    "Title": "Corner Property Gas Station with Real Estate",
    "Revenue": null,
    "Ebitda": "$0 ",
    "Description": "Awesome location Corner property with gas station C store and land, 2300 SQ FT building with 2 bays. This is an awesome piece of property 0.43 Acres on the corner with a 2300 sq ft Building C store garage mechanic and gas station this has great upside value it's in the heart of Gainesville on one of the most prestigious corners!  Owner is retiring. Don't miss out on this opportunity!\n\n\n\nThis is an awesome piece of property 0.43 Acres on the corner with a 2300 sq ft Building C store garage mechanic and gas station this has great upside value it's in the heart of Gainesville one of the most prestigious corners owner retiring\nDon't miss out on this opportunity!!!",
    "URL": "https://www.tworld.com/locations/jacksonville/listings/corner-property-gas-station-with-real-estate",
    "Geographic Location": "Alachua County,  Florida",
    "Agent Name": "Joseph DiBartolo",
    "Agent Email": "jdibartolo@tworld.com",
    "Agent Cell Phone": "(352) 221-9667",
    "Sale Price": "$625,000 "
  },
  {
    "Title": "Commercial T-Shirt Printing Business with Growing Revenue!",
    "Revenue": null,
    "Ebitda": "$96,742 ",
    "Description": "Commercial T-Shirt Business with many years of experience.  Great relationships with local Independent School Districts.  Revenues are increasing towards pre-pandemic numbers.  Room to grow!",
    "URL": "https://www.tworld.com/locations/centraltexas/listings/commercial-t-shirt-printing-business-with-growing-revenue-",
    "Geographic Location": "Travis County,  Texas",
    "Agent Name": "Andrew Chittamai",
    "Agent Email": "achittamai@tworld.com",
    "Agent Cell Phone": "(512) 831-3653",
    "Sale Price": "$625,000 "
  },
  {
    "Title": "Profitable Commercial and Residential Landscape Business",
    "Revenue": null,
    "Ebitda": "$219,705 ",
    "Description": "This profitable business offers contracted services to commercial and residential clients for landscaping needs and winter maintenance. Operating successfully for over 30 years, this well-established business is a great opportunity to add to an existing book of business or start up new. They have a solid base of multi-year contracts along with many repeat customers. Seller is looking forward to retirement and is interested in staying on as a manager or extra hand. Contact Broker for more details.",
    "URL": "https://www.tworld.com/locations/newhampshire/listings/profitable-commercial-and-residential-landscape-business",
    "Geographic Location": "Rockingham County,  New Hampshire",
    "Agent Name": "Jody Reese",
    "Agent Email": "jreese@tworld.com",
    "Agent Cell Phone": "(603) 935-5099",
    "Sale Price": "$595,000 "
  },
  {
    "Title": "International Provider of Professional Oversight Services for Oil & Gas Industry - BN000036016",
    "Revenue": "$1,616,000 ",
    "Ebitda": "($54,000)",
    "Description": "DESCRIPTION:\nThe business is a provider of various professional oversight services for offshore and onshore inspection, surveying, marine, and commissioning projects for the worldwide oil and gas industry.\nKEY ASPECTS:\n• Comprehensive core knowledge and capabilities in oversight services delivered with the highest professionalism and flexibility\n• Tripling of year-over-year revenue from 2019 to 2020\n• Company holds a Master Service Agreement (MSA) with a major energy corporation\n• Pending approval to do business in Kuwait as of Q3 2021\n• Trademarked company logo and slogans\nOPPORTUNITIES:\n• Planned geographic expansion into Dubai and Egypt by securing a key MSA with a major energy corporation\n• Develop formal marketing plan to further build and diversify client base\nMARKET CURRENTLY SERVED:\n• The business primarily serves major worldwide oil and gas production clients that have onshore and offshore rig activity.\nHEADQUARTERED:\n• Southern US\nREAL ESTATE:\n• The business operates 100% remote with team members based domestically, as well as abroad.\nSHAREHOLDER OBJECTIVES:\n• Ownership is seeking a buyer to help grow the business to its full potential. Ownership is open to various deal structures in order to facilitate a transaction.",
    "URL": "https://embracebenchmark.com/listing/international-provider-of-professional-oversight-services-for-oil-gas-industry-bn000036016",
    "Geographic Location": "Worldwide",
    "Agent Name": "Brenda Spencer",
    "Agent Email": "bspencer@benchmarkintl.com",
    "Agent Cell Phone": null,
    "Sale Price": null
  },
  {
    "Title": "Security Equipment Installation & Remote Internet Video Surveillance - BN000028910",
    "Revenue": "$2,199,000 ",
    "Ebitda": "$260,000 ",
    "Description": "The company installs and maintains Video Security Systems nationwide and provides Remote Security Guard Surveillance 24/7/365\n\nKey Aspects\n\nOperating for 15 years, the company has established an enviable reputation within the Industries served\nRevenue has grown at a compound annual growth rate of 16% from 2017 to 2020\nHolds multiple contracts within the Recycle, Salvage, Auto, Oil & Gas Industries\nOwns and operates proprietary Monitoring Center staffed 24/7/365\nIndependently owned with no outside investors\nIndependent contractor sales force strategically located throughout the USA\nLicensed GeoVision distributor with VM software at the Monitoring Center and all Customer locations • High barriers to entry due to capital investments and people cost required to obtain cash flow positive position.\n\nOpportunities\n\nGrow the sales force\nExpand market presence\nLaunch into new market segments\nIncrease service offering\n\nHeadquartered\n\nGeorgia\n\nCurrent Markets\n\nUnited States\n\nReal Estate\n\nThe company operates from a 4,000 sq. ft. facility leased from an unrelated third party. There is room to grow in the current location.\n\nShareholder Objectives\n\nThe principles are interested in a sale with a better capitalized, top security system and services firm, in order to help grow the current market segments and enter new markets.",
    "URL": "https://embracebenchmark.com/listing/security-equipment-installation-remote-internet-video-surveillance-bn000028910",
    "Geographic Location": "Southeast US",
    "Agent Name": "William Sullivan",
    "Agent Email": "wsullivan@benchmarkintl.com",
    "Agent Cell Phone": "813-898-2350",
    "Sale Price": null
  },
  {
    "Title": "Wholesale Distributor of High Quality Building Products - BN000035844",
    "Revenue": "$68,849,000 ",
    "Ebitda": "$8,668,000 ",
    "Description": "The company is a wholesale distributor of high-quality building products. The company's main product lines include moulding and boards (80% of revenue), as well as various other product lines, including exterior railings, stair parts, and columns.\n\nKey Aspects\n\nRevenues and adjusted EBITDA have grown at a compound annual growth rate (CAGR) of 13.5% and 69.8%, from 2018 to the trailing-twelve-months (TTM) ending August 31st, 2021, respectively\n27.2% average gross profit margin over the last three years and the TTM ending August 31st, 2021\nAnnualized 2021 revenue is projected to increase by 38.3% from the year prior\n$17 Million of inventory as of September 2021\nOver 700 customers; no one customer accounting for more than 4% of 2020 revenue\n95% repeat business rate\nForest Stewardship Council® Chain-of-Custody (FSC CoC) certified products\nExperienced, highly-skilled employees with an average of 20 years of industry experience\n\nOpportunities\n\nContinue to diversify product and service offerings and expand operations geographically to increase customer reach\nCapitalize on the global construction industry growth, which is expected to grow at a CAGR of 4.7% from 2021 to 2025\nImplement a strategic marketing plan to accelerate continued growth\nFurther develop the company’s website to offer an online portal for customers to place orders\n\nHeadquartered\n\nEastern US\n\nCurrent Markets\n\nThe company serves residential builders and remodelers through a network of lumber yards located throughout the Eastern US.\n\nReal Estate\n\nThe company operates from its headquarters in a 40,000 sq. ft. facility leased from an unrelated third party. Additionally, the company has distribution centers and sales office locations in select markets within the Eastern US. Additional details can be made available upon request.\n\nShareholder Objectives\n\nThe firm is owned by 15 shareholders. They feel the company is in a position where new ownership can take advantage of the growth opportunities in the industry. All the shareholders are ready to remain with the business for a transition period.",
    "URL": "https://embracebenchmark.com/listing/wholesale-distributor-of-high-quality-building-products-bn000035844",
    "Geographic Location": "Eastern US",
    "Agent Name": "Paul Manry",
    "Agent Email": "pmanry@benchmarkintl.com",
    "Agent Cell Phone": "813-898-2350",
    "Sale Price": null
  },
  {
    "Title": "Well-Established Auto Part Manufacturer",
    "Revenue": null,
    "Ebitda": null,
    "Description": "A company specializing in the production of automotive wire harnesses for US automobile original equipment manufacturers. The company’s wire harnesses connect various devices to the vehicles big back bone harness (e.g., body, engine and Instrument panel). The company also specializes in providing wire harness products to the OEM dealer network.\n\nKey Aspects\n\nIndustry expertise and recognition for providing best-in-class wire harnesses and components for the US auto industry\nExpansive product line with over 1,000 SKUs\nDirect Tier 1 supplier to automotive OEMs\nStrategic HQ and production/warehouse locations all located in the heart of the US automobile industry\n\nOpportunities\n\nExpand into retail, brick-and-mortar auto part stores and e-commerce\nCapitalize on opportunity of outfitting growing electric car segment of the auto industry\nReduce labor costs by locating production in offshore markets\n\nReal Estate\n\nThe company operates from three facilities spanning over 40,000 sq. ft. Two of the three locations are owned by the company’s sole shareholder and the third facility is leased from an unrelated third party.\n\nShareholder Objectives\n\nThe owner is seeking an exit or partial exit for retirement purposes. He is open to remaining on with new ownership for a transition period of up to one year or longer.",
    "URL": "https://embracebenchmark.com/listing/well-established-auto-part-manufacturer",
    "Geographic Location": "Midwest United States",
    "Agent Name": "Matt Kekelis",
    "Agent Email": "MKekelis@benchmarkintl.com",
    "Agent Cell Phone": "615-924-8950",
    "Sale Price": null
  },
  {
    "Title": "Temporary Staffing and Permanent Recruiting Firm Specializing in Information Technology Employment-BN000032926",
    "Revenue": "$5,012,000 ",
    "Ebitda": "$246,000 ",
    "Description": "The company engages IT professionals through contract, contract-to-hire, direct placement and recruitment services. It fosters partnerships with innovative clients seeking to elevate their initiatives through the brilliant and inventive IT professionals who bring the impossible to fruition.\n\nKey Aspects:\n· Commitment to living out company vales and simply doing what is right. That comes with a servant attitude and doing what is best for its Candidates and its Clients, dollars aside\n· Referral and relationship-based success driven by strong employee base with motivations that align with the company’s values\n· Award winning company that has been included in the 2020 and 2021 Inc. 5000 fastest-growing private companies list\n· Maintains a healthy and financially solid mix of long-standing and new clients, across all industries\n· Selected year-over-year as a preferred provider for several large Corporations using vendor management systems: Expedia Group (12 years), Starbucks Corporation (7 years), and Disney Worldwide Services (5 years)\n· Reputation for connecting high-quality talent to the right opportunities elevates its contract to full-time conversion rates over the competition\n· Technical training and collaborative dialogue with its own offsite technical wizards strengthens its internal recruiting talent in this competitive landscape\n\nOpportunities:\n· Secure and expand upon the established industry network and contracts in place with key businesses in the tech hub of the country\n· Increase exposure to potential clients through expanded digital marketing efforts and additional business development employees\n· Attractive bolt-on opportunity for recruiting firms outside of Washington, or without a specialization in IT, looking to capitalize on the company's industry network\n\nHeadquartered:\n· Washington\n\nCurrent Markets:\n· The company provides temporary and permanent staffing services of IT professionals to commercial clients across all industries, with the primary geographic market being the West Coast, as Seattle is the tech hub of the country. In addition, the company provides services to the Southwestern U.S., including Arizona and Texas, as well as the Midwest, including Chicago.\n\nReal Estate:\n· The business is incorporated in Arizona and is domiciled in Washington in a 1,765 square-foot facility leased from an unrelated third party.\n\nShareholder Objectives:\n· Ownership is comprised of one majority and one minority shareholder. The majority shareholder desires a full exit after a transitional period to pursue unrelated business ventures, while the minority shareholder is open to staying on with the company and helping it achieve its growth potential. Both shareholders are willing to entertain a variety of opportunity structures.",
    "URL": "https://embracebenchmark.com/listing/temporary-staffing-and-permanent-recruiting-firm-specializing-in-information-technology-employment-bn000032926",
    "Geographic Location": "Washington",
    "Agent Name": "Amy Alonso",
    "Agent Email": "alonso@benchmarkintl.com",
    "Agent Cell Phone": "512-347-2000",
    "Sale Price": null
  },
  {
    "Title": "Custom Heavy Bag Manufacturer Based in Texas",
    "Revenue": "$3,716,000 ",
    "Ebitda": "$142,000 ",
    "Description": "DESCRIPTION:\nThe business provides complete turnkey flexible packaging solutions, and specializes in plain and printed roll stock for form fill and seal machines, open mouth bags, custom fit container liners and pallet covers.\n\nKEY ASPECTS:\n• FYE 2020 revenue of $3.7 million\n• Recognizable and reliable brand within the lawn & garden and petrochemical industries\n• Low turn around time and quality products with accurate and efficient production\n• Deemed a critical supplier to key petrochemical producer\n• Low order minimums compared to competitors\n• High supplier diversity allowing for efficiencies and effective alternatives\n\nOPPORTUNITIES:\n• Recent acquisition of an eight-color CI printing press is expected to allow for more process printing capabilities\n• Expand outside of current market\n• Capitalize on increased operating hours\n• Add comprehensive marketing and advertising strategies to reach other customer markets\n\nMARKET CURRENTLY SERVED:\n• The business currently serves the lawn & garden and petrochemical industries nationwide.\n\nHEADQUARTERED:\n• Texas\n\nREAL ESTATE:\n• The business operates from a 25,000 square-foot area that includes four facilities in Houston, Texas which is leased from a related party.\n\nSHAREHOLDER OBJECTIVES:\n• The majority owners are seeking retirement and a more balanced lifestyle. They are open to various deal structures to facilitate a transaction and to a reasonable transition time to new ownership.",
    "URL": "https://embracebenchmark.com/listing/custom-heavy-bag-manufacturer-based-in-texas",
    "Geographic Location": "Texas",
    "Agent Name": "Brenda Spencer",
    "Agent Email": "bspencer@benchmarkintl.com",
    "Agent Cell Phone": null,
    "Sale Price": null
  },
  {
    "Title": "A Growing Multi-location Comprehensive Pediatric Therapy Services Provider - BN000033344",
    "Revenue": "$1,500,000 ",
    "Ebitda": "$42,000 ",
    "Description": "The company is a comprehensive therapy practice that offers speech therapy, occupational therapy, and physical therapy to children with special needs. The company has over 20 licensed therapists.\n\nKey Aspects\n\nOperating in growth mode; revenue and book EBITDA increased by a compounded annual growth rate of 36.7% and 12.2% from 2018 to 2020, respectively\nDiverse service offerings including speech therapy, occupational therapy, physical therapy, and recently teletherapy\nSees nearly 24,000 patients annually\nFrom 2019 to 2020, claims billed nearly doubled\n22 licensed therapists in three disciplines\nFour locations in three counties\nRecognized as the “Best Speech Pathologists” in its service area\n\nOpportunities\n\nContinue to expand locations and presence throughout the Southeast US\nDevelop additional relationships with providers in its service area to increase referrals and gain new patients\nTake advantage of the growing demand for speech language pathologists, occupational therapists, and physical therapists, which is expected to grow from 16-30% over the next ten years\n\nHeadquartered\n\nSoutheast US\n\nCurrent Markets\n\nThe company serves pediatric patients with special needs.\n\nReal Estate\n\nThe company operates from four locations within an urban market in the Southeast. Two facilities are owned by affiliated entities and two facilities are leased from unrelated third parties.\n\nShareholder Objectives\n\nThe company is owned by a single active shareholder. She is seeking exit options to pursue other interests and believes the company is in a position where new ownership can take advantage of the growth opportunities in the market.",
    "URL": "https://embracebenchmark.com/listing/a-growing-multi-location-comprehensive-pediatric-therapy-services-provider-bn000033344",
    "Geographic Location": "Southeast US",
    "Agent Name": "Paul Manry",
    "Agent Email": "pmanry@benchmarkintl.com",
    "Agent Cell Phone": "813-898-2350",
    "Sale Price": null
  },
  {
    "Title": "Commercial Construction and Renovation Firm - BN000035966",
    "Revenue": "$20,407,000 ",
    "Ebitda": "$1,884,000 ",
    "Description": "The company is a full-service general contracting firm specializing in large commercial construction, including development, design-build, renovation, and rehab projects. The team works closely with owners and subcontractors to develop value-add designs and engineering that ensure a premium product for its clients.\n\nKey Aspects\n\nOperating in growth mode; revenue has grown at a compound annual growth rate (CAGR) of 51.8% from 2018 to the TTM ending July 31, 2021\nAs of August 2021, the company secured contracts totaling approximately $7.8 million\n$15 million in bonding capacity\nA+ rating on the Better Business Bureau (BBB)\n\nOpportunities\n\nContinue to increase project management capacity to meet unmet market demand\nContinue to expand geographic market across the Southeast US\nContinue to build its brand awareness with builders, developers, and property owners\nIncrease field employee capacity to support and engage in additional projects\n\nHeadquartered\n\nSoutheast US\n\nCurrent Markets\n\nThe company serves property owners, builders, and developers throughout Southeast US. The company completes commercial, medical, and retail renovations and ground-up projects.\n\nReal Estate\n\nThe company operates from a 2,200 sq. ft. headquarters and a 600 sq. ft. office, both leased from unrelated third parties.\n\nShareholder Objectives\n\nThe company is owned by a single shareholder. He is not active in the business and is seeking exit options to pursue other interests. He is willing to remain with the company for a transition period to ensure a smooth transfer of ownership.",
    "URL": "https://embracebenchmark.com/listing/full-service-general-contracting-firm-specializing-in-large-commercial-construction-bn000035966",
    "Geographic Location": "Southeast US",
    "Agent Name": "Paul Manry",
    "Agent Email": "pmanry@benchmarkintl.com",
    "Agent Cell Phone": "813-898-2350",
    "Sale Price": null
  },
  {
    "Title": "Retail Display Provider Specializing in Plastic, Metal & Wood Manufacturing - BN000033374",
    "Revenue": null,
    "Ebitda": null,
    "Description": "The company manufactures customized, budget-optimized, turnkey point-of-purchase (POP) displays utilizing various materials. In-house capabilities include acrylic & sheet plastic fabrication, metal fabrication, CNC machining & laser cutting, plating, and custom project packaging.\n\nKey Aspects\n· State-of-the-art on-site resources include CNC & laser machinery, presses, design studio, prototyping, industry-leading ERP software, warehousing and distribution services allowing full turnkey processes\n· Investment in proven and established internal processes for key company segments including marketing, sales, operations, and technology\n· Company owned patents and trademark\n· Company strategically positioned for scalable growth\n· Strong industry reputation stemming from comprehensively built network of suppliers, prominent clients, and highly-skilled employees, creating continuous business opportunities\n· Diverse variety of material offerings and in-house service capabilities provide unique competitive advantages and solutions to complex challenges\n· One-stop-shop providing superior customer service, dedicated project management, and a focus on long-term relationships\n\nOpportunities\n· Scale the company to the next level with increased personnel, facility capacity, and project funding\n· Expand product materials to cater to a wider product base in new end markets while growing business within existing markets\n· Expand geographically to facilities in other parts of the United States to cater to nationwide demographic\n· Buyers with strong supplier bases and terms could reduce material costs and increase profitability\n\nHeadquartered\n· DFW Metroplex, Texas Area\n\nCurrent Markets\n· The offering serves various industries including several Fortune 500 companies throughout the world with a focus in retail, education, hospitality, and government sectors. The company has the capacity and reach to deliver custom solutions of any size and complexity, anywhere.\n\nReal Estate\n· The company’s headquarters facility is a 21,000 square-foot manufacturing site with access to an additional 6,500 squarefoot metal manufacturing space. The lease may be assumed as a part of a sale.\n\nShareholder Objectives\n· The sole owner is seeking the right cultural fit to assist in rapid expansion of the business with an eventual exit in mind to spend more time with family.",
    "URL": "https://embracebenchmark.com/listing/bn000033374-global-award-winning-turnkey-acrylic-display-and-manufacturing-business-in-texas",
    "Geographic Location": "Southern United States",
    "Agent Name": "Kendall Stafford",
    "Agent Email": "stafford@benchmarkintl.com",
    "Agent Cell Phone": "512-347-2000",
    "Sale Price": null
  },
  {
    "Title": "Industrial Machinery Repair Company  - BM006940",
    "Revenue": "$3,806,000 ",
    "Ebitda": "$1,688,000 ",
    "Description": "The company is a full-service machine shop supporting industrial, field (turn around) maintenance, as well as in-situ machining and repair. It specializes in the repair of valves, rotating equipment, compressors, gear boxes, and power generation support.\n\nKey Aspects\n\nGross profit and adjusted EBITDA margins have averaged 61.8% and 41.6% from 2017 to 2020, respectively\nAdjusted EBITDA grew at a CAGR of 10.4% from 2017 to 2020\nContracts in place with its top customers\nRevenue breakdown: 87% repair work and 13% manufacturing\nTop supplier relationships average over eight years\nStrong geographic location near top customers\nOwns a large fleet of machinery and equipment\nSpecializes in outages, with an established reputation as a reliable solution for critical time-dependent jobs\nWebsite is Search Engine Optimized (SEO)\n\nOpportunities\n\nExpand into millwright services; it is currently offered as a complimentary service\nExpand geographic footprint\nDevelop a sales team to capture untapped market share\nCapitalize on the recent shift in the industry; customers are starting to outsource internal maintenance needs\nImplement a comprehensive marketing strategy in order to capture a greater market share\n\nHeadquartered\n\nMid-Atlantic US\n\nCurrent Markets\n\nThe company provides its services to the industrial, manufacturing, chemical, and power generation industries throughout the United States.\n\nShareholder Objectives\n\nThe company is owned by two shareholders. The owners are proud of the company they have built and believe the business is in a position where new ownership can take advantage of growth opportunities in the industry and take the company to the next level. They are willing to remain with the company for a period of time to ensure a smooth transfer of ownership.",
    "URL": "https://embracebenchmark.com/listing/a-full-service-industrial-services-company-bm006940",
    "Geographic Location": "Mid-Atlantic US",
    "Agent Name": "William Sullivan",
    "Agent Email": "wsullivan@benchmarkintl.com",
    "Agent Cell Phone": "813-898-2350",
    "Sale Price": null
  },
  {
    "Title": "Wood Framing and Concrete Building Slab Contractor",
    "Revenue": "$13,000,000 ",
    "Ebitda": "$2,040,000 ",
    "Description": "Based in Arizona, the Company is a new construction wood framing contractor and concrete building slab contractor. In 2020, revenue was derived from wood framing (90%) and building slab concrete (10%) installation. The Company serves five main customers currently in the Arizona construction market, primarily focusing on apartments. The Company experienced high growth during the historical period and is looking to continue the trend. The recent housing market in the local economy pushed this growth. The Company built an excellent reputation for high-quality work and excellent customer service. Because of these two factors, the Company has great client relationships and enjoys a high rate of repeat business (95%).\n\n\nInvestment Considerations:\n\nRising Profit Trend: Earnings as measured by EBITDA grew at a 45.4% CAGR between 2018 and 2020.\n\nStrong Historical Sales Growth: Revenue grew overall at a 19.7% CAGR between 2018 and 2020.\n\nStrong Balance Sheet: Owner’s equity (unadjusted) at December 31, 2020 was $2,728,000.\n\nExperienced and Tenured Staff: The Company’s quality staff is experienced and dependable. A project manager, an accounting/office manager, four project superintendents, and a concrete coordinator have all been with the Company\nfor 11-15 years each.\n\nFavorable Outlook for Industry Growth: The value of US private and public building construction, a major indicator for framing contractors, is forecast to grow at an annual compounded rate of 4% between 2020 and 2025",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": "Southwestern U.S.",
    "Agent Name": "Cole Preston",
    "Agent Email": "cpreston@generational.com",
    "Agent Cell Phone": "(949) 679-4518",
    "Sale Price": null
  },
  {
    "Title": "Telecommunications Consulting",
    "Revenue": "$2,800,000 ",
    "Ebitda": "$330,000 ",
    "Description": "This unique acquisition opportunity for a telecommunications consulting establishment. The Company provides, services, and supports telecom equipment for the hospitality industry. In 2020, revenue was generated from equipment sales (46%), telecom commissions (31%), equipment service (14%), and telecom expense management (7%). The Company differentiates itself on response time, being nimble, and by a commitment to proactively find a resolution. Since the Company is not bound to any vendor exclusively, it focuses on providing the best solutions for customers.\n\n\n Investment Considerations \n\nSuperior Name and Reputation: The Company provides customers in the hotel industry a wide array of telecom products and value-added services. The Company has built a loyal and still-growing customer base, and has an excellent reputation for its experience, knowledge, and superior customer service levels.\n\nStrong Client Relationships: The Company has many longstanding customers and a high rate of repeat business. The top five customers in 2020 have been doing business with the Company since its inception.\n\nNational Reach: The Company serves customers across the U.S. In 2020, 40% of customers were in the Midwest, 40% in the East and 20% in the West.\n\nRecurring Revenue Stream: The Company’s telecom expense management (TEM) service provides an ongoing revenue stream.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": null,
    "Agent Name": "Donald Beezley",
    "Agent Email": "dbeezley@generational.com",
    "Agent Cell Phone": "(303) 886-0809",
    "Sale Price": null
  },
  {
    "Title": "Private Outdoor Recreation Club",
    "Revenue": "$3,200,000 ",
    "Ebitda": "$364,000 ",
    "Description": "Based in Northern California, the Company is a private outdoor recreation club in the West. By partnering with landowners, the Company provides safe, uncrowded areas for families and individuals to go hunting, fishing, and camping on safe, private land that is posted and patrolled by the Company. In 2021, revenue was derived from memberships as follows: Active Full (50%), Active Big Game (15%), Limited (15%), Camping and Fishing (7%), Plus (8%), and Bird (5%). The Company differentiates itself by its unique offering and by developing personal relationships with its members, striving to include lifetime family memberships and spurring multi-generational memberships. The Company maintains member satisfaction by providing a high level of customized and responsive member education, services and offerings.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": "Western U.S.",
    "Agent Name": "James R. Hermann",
    "Agent Email": "jhermann@generational.com",
    "Agent Cell Phone": "(972) 908-0770",
    "Sale Price": null
  },
  {
    "Title": "Premier Iconic Outdoor Recreation Brand",
    "Revenue": "$17,000,000 ",
    "Ebitda": "$1,560,000 ",
    "Description": "This premier consumer products company, led by the founding family, is celebrating over 150 years of delivering innovative outdoor recreational products for year-round enjoyment.  Offering a diversified multi-seasonal product range, in addition to a growing direct to consumer online business, the company’s iconic brand is a respected feature anchor in the sports category for leading retailers.  Recognized for their on-trend design, speed to market and production quality, the company maintains a unique balance of domestic and overseas manufacturing, posting strong growth through their diversified customer strategy.\n\nINVESTMENT APPEAL\nDiversified distribution. The company’s products are sold through a combination of leading retail store chains, e-commerce platforms and independent retailers reflecting the evolution of consumer purchasing preferences.\n\n  Established and Trusted Supply Relationships. The company benefits from proven long-term product development, sales, and replenishment programs utilizing a diversified manufacturing model of US and Asian manufacturing.\n\n Management Expertise. Led by the fifth generation of the original Company’s founding family, the management team members combine extensive experience in the outdoor recreation industry with innovative approaches to collaborative product development and direct to consumer distribution.\n\n  Significant Growth Opportunities. The outdoor recreation market is demonstrating long term growth trends as consumers continue to invest increasingly in the sector. With strong year over year growth in core product categories, the Company is also expanding its product range through category expansion of its iconic brand.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": "Northeastern U.S.",
    "Agent Name": "David Fergusson",
    "Agent Email": "dfergusson@generational.com",
    "Agent Cell Phone": "(914) 374-7396",
    "Sale Price": null
  },
  {
    "Title": "Restaurant Equipment and Supplies",
    "Revenue": "$3,100,000 ",
    "Ebitda": "$212,000 ",
    "Description": "The Company sells restaurant equipment and supplies, including baking, food storage, refrigeration, barware, concession, catering, food preparation, flatware, plateware, tabletop, janitorial, and other specialized cooking supplies as well as commercial-scale equipment. The Company targets both commercial and retail market segments. To support successful operations, the Company has over 6,000 SKUs and also provides regional delivery services. The Company targets single-location restaurants (71% of 2020 revenue), schools and institutions (14%), chain restaurants (10%), and retail consumers (5%).\n\n INVESTMENT APPEAL\n\nStrong Customer Relationships - The Company has strong ties to clients due to its industry expertise, immediate product availability, vendor relationships, and excellent customer service. Specifically, the Company’s base includes approximately 4,200 customers; no single customer accounted for more than 8% of revenue during the historical period. Due to the Company’s reputation, long-term presence in the industry, and high-quality of customer service, the Company’s recurring customer rate exceeds 70%\n\n  Proprietary Expertise - In addition to the principal's extensive industry experience, many of the Company’s key employees also have significant industry and service knowledge. This wealth of experience and expertise provides BPRS with a significant intangible asset and advantage over many regional and national competitors.\n\n Superior Name and Reputation - The Company is well known in the restaurant and kitchen product supply market, and has an excellent reputation for customer service as well as high quality products.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": "Southern U.S.",
    "Agent Name": "Cory Strickland",
    "Agent Email": "cstrickland@generational.com",
    "Agent Cell Phone": "(469) 965-8686",
    "Sale Price": null
  },
  {
    "Title": "Building Code and Fire Code Consulting",
    "Revenue": "$1,150,000 ",
    "Ebitda": "$370,000 ",
    "Description": "The Company provides building code and fire code consulting services to public and private markets. The Company has provided code compliance, plan reviews and inspections, and code consulting to customers throughout Colorado and surrounding areas for over 20 years. The Company has long term experience in setting up and organizing building departments, and providing administrative support that gives its clients the expertise that is needed for administrative issues that they may be facing. In 2020 the market mix comprised state government (CO) (80% of revenue), architects (5%), municipalities (10%), and private owner/managers (5%). Operations are supported by 6 employees and 4 long term subcontractors.\n\n Investment Considerations:\nDocumented Systems and Procedures: The Company's refined project model, including operations, documentation, deliverables, and follow up process have been refined over many years, and could be used to blueprint expansion in the future.\n\nSolid Technical Staff in Place: The Company’s core group of engineering, and technical employees/contractors represent a seasoned base that can handle project processes A to Z.\n\n Compelling Value Proposition: The Company's services support a building department, architect, or developer’s internal schedules and help meet timelines. The Company’s expertise, knowledge of current codes, and comprehensive review and follow up procedure, and flexibility to work on an “as needed” or full time basis - provide a compelling value proposition to its customers.\n\n Project Track Record: The Company’s project portfolio includes the \"A\" list of highly visible projects. The Company’s portfolio can be leveraged to open doors to new markets in next-step growth plans.\n\n\nOutstanding Growth Opportunities: Growth opportunities include further penetration in existing markets, new corporate and public markets, and offering additional related consulting services.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": "Western U.S.",
    "Agent Name": "Don Beezley",
    "Agent Email": "dbeezley@generational.com",
    "Agent Cell Phone": "(303) 886-0809",
    "Sale Price": null
  },
  {
    "Title": "Full-Service Digital Environment Creation/Capture & Analytics Firm",
    "Revenue": "$3,000,000 ",
    "Ebitda": "$533,000 ",
    "Description": "The Company specializes in providing “digital twin” technology and analytics solutions to “capture, explore and inform”, fusing its backend ingestion platform with any kind of data (ex: 360-degree imaging), and provides associated integrated data solutions for blue chip clients that rely on them to deliver virtual environments and actionable real-time intelligence on facilities and properties in the US and the Caribbean. The platform is highly flexible and robust, and can transform any “captured” data source to aid in allowing the client to “explore” the environment and interact with the associated analytics data (“inform”).\n\n   INVESTMENT APPEAL\nStrong Historical Sales Growth - Historical sales have grown consistently from $807,000 in 2018 to $2,348,000 in 2020, representing a 70.6% CAGR.\n\n  Rising Gross Profit Trend - The Company's gross profit margin increased over the historical period from 68.4% of sales in 2018 to 71.1% in 2020, and is expected to increase over the pro forma period.\n\n Multi-Year Contracts - Revenue The Company has contracts renewing or extending over multiple years that offer recurring revenue streams.\n\n Established Blue-Chip Clients - The Company does business with several blue-chip and top-tier, well established and reputable companies, and  It's top five customers in 2020 include Walmart, Inc, Target, Marriott, and FCP.\n\n  Diversified Customer Industries - The Company maintains a loyal client base within multiple industries, which includes retail, hospitality, and others.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": "Central U.S.",
    "Agent Name": "Stephen Dinehart",
    "Agent Email": "sdinehart@generational.com",
    "Agent Cell Phone": "(608) 833-9396",
    "Sale Price": null
  },
  {
    "Title": "Public Relations Agency",
    "Revenue": "$1,900,000 ",
    "Ebitda": "$102,000 ",
    "Description": "This acquisition opportunity is for a public relations agency focusing on media relations, social media communication, business-to-business marketing, and crisis management. Buyers will inherit a fiery team of public relations professionals, creators and designers who help clients elevate the common human element inherent in their brand, leading to positive change in the world. The Company offers a diverse portfolio of premiere public relations services meeting the unique and individual needs of every client.\n\nInvestment Considerations:\n\n Superior Name and Reputation: A buyer for this Company will enjoy a long-standing reputation for quality services, expertise, dependability, and superior customer experience. The Company has a strong reputation in the industry based on professional achievements, and as outspoken advocates for socially conscious brands.\n\n\nStrong Management Team: The Company’s management team has a tremendous amount of experience delivering professional public relations services, providing quality service with proactive and responsive customer service.\n\nOutstanding Growth Opportunities: Opportunities exist to increase revenues and profits by leveraging the Company’s strong reputation to pursue and penetrate new and existing markets.\n\nStrong Historical Sales Growth: Historical sales have grown from $1,257,000 in 2018 to $1,899,000 in 2020, representing a compound annual growth rate of 22.9%. Sales have grown consistently year over year in the historical period.\n\nGrowing Market for the Company’s Services: According to an industry study by IBIS World in 2021 titled, “Public Relations Firms in the US,” projected growth for public relations services is derived from corporations reallocating funds toward marketing initiative. Over the next five years, industry experts anticipate strong demand for PR services.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": null,
    "Agent Name": "Paul Hajek",
    "Agent Email": "phajek@generational.com",
    "Agent Cell Phone": "(208) 340-8482",
    "Sale Price": null
  },
  {
    "Title": "Manufacturer & Retailer of Oral Therapeutic Devices",
    "Revenue": "$7,200,000 ",
    "Ebitda": "$2,600,000 ",
    "Description": "This Company is both a manufacturer and wholesaler/retailer of unique oral sensory tools and special needs products. They created an impressive line of oral motor tools, speech and feeding aids, chewing devices, handwriting tools, and other products. The Company sells to individuals and professionals throughout the US and 50+ countries internationally. The Company was founded over 20 years ago in response to an evident lack of tools available for oral motor therapy. Since then, the Company has created over 1000 SKUs, continually updating and developing new products in tune with market demand indications.\n\nThe Company has an extensive portfolio of intellectual property and marketing materials, as well as a strong community of passionate customers. Their brand is well-known for creating innovative solutions that improve one’s quality of life. The Company’s product line has both a niche following and mass appeal, with solutions ranging from vibrating oral therapy tools and adaptive drinking cups to chewable jewelry, fidgets, pencil grips, and more.\n\nAll products are made in the USA with medical grade materials. The Company reaches its markets through its three primary outlets - retail (public), retail P.O. (schools and institutions), and a wholesale store. Retail channels include the Company's website as well as Amazon. 46% of 2020 revenue was from the Company's website, while 35% came from their wholesale channel. International sales attributed to 35% of revenue.\n\nINVESTMENT APPEAL\nDiversified Markets / International Reach: The Company sells in every U.S. state, and 80 other countries in recent years. Current growth plans call for expanded penetration to certain markets through independent distributors.\n\n Patents and Proprietary Products: The IP portfolio includes 30 trademarks for major product names, 14 design and utility patents, and 4 copyrighted designs.\n\nOutstanding Growth Opportunities: A number of identifiable growth opportunities include new markets (eg. adult, nursing home, schools, other); product line expansion; and various sales and marketing initiatives.\n\nProfit Margins Substantially Above Industry Benchmarks: The Company's gross margin of 74% to 78% and pretax margin of 31% to 37% are both dramatically higher than the general industry (dental equipment and supplies manufacturing) average benchmarks of 59% and 8%, respectively, reflecting niche products, and pricing power in its markets.\n\nStrong Growth - Critical Mass: Revenues have grown nearly every year since inception. The Company will reach $7.2 million in revenue in 2021 and $8 million in 2022. Sales at these levels will be attractive to buyers seeking immediate market share in a niche product line with high margins.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": "Southeastern U.S.",
    "Agent Name": "Jack Sluiter",
    "Agent Email": "jsluiter@generational.com",
    "Agent Cell Phone": "(904) 840-8390",
    "Sale Price": null
  },
  {
    "Title": "Well-Established Computer Network  Design & Implementation Company",
    "Revenue": "$2,910,000 ",
    "Ebitda": "$498,000 ",
    "Description": "The Company is a provider of computer network designs and implementation, hosted infrastructure solutions including data storage and desktop virtualization, and network support to customers with complex, multi-site installations. The Company is a leader in offering outsourced IT support to allow customers to focus on growing operations. Its approach is to provide proactive care so that IT issues can be eliminated prior to causing downtime or business disruption.  The Company’s markets include: property management, medical, and other (34%) customer markets in Tennessee. The Company’s call center services clients in 21 states and is well-positioned for continued growth and success.\n\n\nINVESTMENT APPEAL\n\n• Turnkey Capabilities: As a one-stop shop, clients often find it convenient and more affordable to find an array of hardware and software servicing within one Company. \n\n• Recurring Revenue: The majority of revenue is generated from monthly recurring service contracts. The Company’s system increases the operational efficiency and profitability of its customers, creating a sticky source of recurring revenue for the Company.\n\n• Diversified Customer Base: The Company maintains a loyal client base within multiple industries, which includes property management, medical, and a variety of others. Operating within multiple industries helps ensure the Company will not be significantly impacted during a slow down within a single industry.\n\n• Superior Name and Reputation: The Company enjoys a long-standing reputation for supplying quality IT services, specifically in relation to property management hardware and software infrastructure.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": "Central U.S.",
    "Agent Name": "Julie Sandoval",
    "Agent Email": "jsandoval@generational.com",
    "Agent Cell Phone": "(678) 646-6704",
    "Sale Price": null
  },
  {
    "Title": "Concrete Accessories & Rebar Fabricator",
    "Revenue": "$2,900,000 ",
    "Ebitda": "$397,000 ",
    "Description": "This acquisition opportunity is for a rebar fabricator and a wholesaler/retailer of professional tools, equipment, and concrete accessories. Focusing on customer driven solutions, the Company is well-regarded for its ability to provide the right products to meet customer needs, and for a solid level of responsiveness. This has resulted in a high rate of repeat business and referrals. Strong customer relationships coupled with key employees who have significant market and service knowledge, have contributed to strong growth in 2021, and is expected to continue over the coming years.\n\nInvestment Considerations\n\n\nSuperior Name and Reputation: The Company has a strong reputation for its focus on service, offering reliable expertise, providing high-quality concrete accessories, and rebar fabrication services.\n\n\nHigh Customer Retention Rate: Due to the Company’s reputation, long-term presence in the industry, and breadth of product offerings, recurring revenue exceeds 90%.\n\n\nIndustry Expertise: In addition to the principals' extensive concrete accessories industry experience, many of the Company’s key employees also have significant market and service knowledge. This wealth of experience and expertise provides The Company with a significant advantage over regional competitors.\n\n\nStrong Base Performance and Growth: In 2021, the Company's revenue is on track to reach $2.9 million, 19.9% growth over 2020. The Company intends to capitalize on its broad inventory selection, recurring customer base, and strong long-term regional geographic presence.\n\nOutstanding Industry Potential: Growth in the new housing construction market is expected to expand over the five years to 2026. New housing construction drives demand for infrastructure, the primary end market for the Company.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": null,
    "Agent Name": "Randy Bernard",
    "Agent Email": "rbernard@generational.com",
    "Agent Cell Phone": "(303) 717-7884",
    "Sale Price": null
  },
  {
    "Title": "Wholesale Distribution of  Automotive Parts",
    "Revenue": "$2,800,000 ",
    "Ebitda": "$341,000 ",
    "Description": "Based in Northern California, the Company is a privately-owned franchisee that provides wholesale distribution of automotive aftermarket undercar parts. The Company’s warehouse stocks complete lines of top-quality parts. Customers receive instant price and availability information via telephone or electronic data interchange. Order fill is consistently greater than 97%, and delivery is immediate. Brake parts, steering and suspension components and power transmission parts are among the thousands of items it stocks and delivers on its own trucks. The Company is recognized as a market leader, and sells only top-quality products from the leading automotive manufacturers. The Company has a client base composed of 230 active accounts with a 90% rate of repeat business.\n\n\nInvestment Considerations:\n\nStrong Management Team: The Management team has a tremendous amount of experience distributing undercar parts for repair shops in the automotive industry. It is focused on providing quality, timely, and cost-effective products, coupled with proactive and responsive customer service.\nStrong Historical Sales and EBITDA Growth: Historical sales have grown from $1,988,000 in 2018 to $2,739,000 in2020, representing a compound annual growth rate of 17.4%. EBITDA has grown from $126,000 in 2018 to $352,000 in2020.\nStrong Client Relationships: The Company has strong ties to clients due to its industry expertise and excellent customer service. Evidence of these relationships is shown in the 90% rate of repeat business, as well as the fact that 90% of revenue is from referral-based business.\nManagement Will Remain through Transition: The officer is willing to remain through the transition period, and would entertain remaining with new management for a longer period of time on a consultancy basis. Additionally, all key employees will be available to remain with new ownership beyond the sale of the company",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": "Western U.S.",
    "Agent Name": "James R. Hermann",
    "Agent Email": "jhermann@generational.com",
    "Agent Cell Phone": "(972) 908-0770",
    "Sale Price": null
  },
  {
    "Title": "Highly Rated Window and Door Contractor",
    "Revenue": "$2,500,000 ",
    "Ebitda": "$448,000 ",
    "Description": "The Company is a custom residential door and window contractor. The Company is known for its boutique-style customer consultation/experience, and offers the full range of styles, material, energy-efficient options and configuration. The Company focuses on the residential market (90% of 2020 sales) with The average customer project totals $6,000 to $30,000, with larger jobs ranging $100,000 to $170,000+ in recent years. The Company completes over 350 projects annually. As of July 2021, the Company has a five month backlog compared to a three month backlog at the same period in 2020. The Company’s has 10+ full-time, non-union staff.    Investment Considerations: Industry Leading Products: The Company is a long-standing authorized distributor of Andersen Windows, Anlin Windows, Trimlite and Tru-Frame products.  Highly Rated and Recognized: The business has maintained a high rating on social media, 99% Certified customer satisfaction with authorized distributors, and received \"Best in the Area\" awards. Outstanding Growth Opportunities: Growth opportunities exist in leveraging the Company's reputation and operational platform to expand the Company’s footprint regionally. There is significant demand in surrounding areas just outside the Company’s current (approximately 20-mile) radius. Direct Customer Base: The Company’s business model is nearly all (90%) direct-to-consumer, rather than over weighted to contractors and architects. No single customer accounted for more than 1% of revenue during the historical period. The diversified customer base helps ensure that the Company will not be significantly impacted by the loss of a single account or any key referral group/accounts. Investment Considerations: •Industry Leading Products: The Company is a long-standing authorized distributor of Andersen Windows, Anlin Windows, Trimlite and Tru-Frame products.  •Highly Rated and Recognized: The business has maintained a high rating on social media, 99% Certified customer satisfaction with authorized distributors, and received \"Best in the Area\" awards. •Outstanding Growth Opportunities: Growth opportunities exist in leveraging the Company's reputation and operational platform to expand the Company’s footprint regionally. There is significant demand in surrounding areas just outside the Company’s current (approximately 20-mile) radius.",
    "URL": "https://dashboard.dealforce.com/Opportunities.aspx",
    "Geographic Location": "Western U.S.",
    "Agent Name": "James R. Hermann",
    "Agent Email": "jhermann@generational.com",
    "Agent Cell Phone": "(972) 908-0770",
    "Sale Price": null
  },
  {
    "Title": null,
    "Revenue": null,
    "Ebitda": null,
    "Description": null,
    "URL": null,
    "Geographic Location": null,
    "Agent Name": null,
    "Agent Email": null,
    "Agent Cell Phone": null,
    "Sale Price": null
  },
  {
    "Title": null,
    "Revenue": null,
    "Ebitda": null,
    "Description": null,
    "URL": null,
    "Geographic Location": null,
    "Agent Name": null,
    "Agent Email": null,
    "Agent Cell Phone": null,
    "Sale Price": null
  }
]
